id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: At Job Created or Modified
description: >-
  This rule monitors for at jobs being created or renamed. Linux at jobs are
  scheduled tasks that can be leveraged by system administrators to set up
  scheduled tasks, but may be abused by malicious actors for persistence,
  privilege escalation and command execution. By creating or modifying cron job
  configurations, attackers can execute malicious commands or scripts at
  predefined intervals, ensuring their continued presence and enabling
  unauthorized activities.
tags:
  - attack.persistence
  - attack.TA0003
  - attack.t1053
  - attack.t1053.002
  - attack.privilege_escalation
  - attack.TA0004
  - attack.execution
  - attack.TA0002
falsepositives: []
level: medium
status: experimental
references:
  - 'https://attack.mitre.org/techniques/T1053/'
author: hoang.nguyen
detection:
  condition: >-
    selection and not (filter1 or filter2 or filter3 or filter4 or filter5 or
    filter6 or filter7)
  selection:
    host.os.type:
      - linux
    event.action|contains:
      - rename
      - creation
    file.path:
      - /var/spool/cron/atjobs/*
  filter1:
    process.executable|contains:
      - /bin/dpkg
      - /usr/bin/dpkg
      - /bin/dockerd
      - /usr/bin/dockerd
      - /usr/sbin/dockerd
      - /bin/microdnf
      - /usr/bin/microdnf
      - /bin/rpm
      - /usr/bin/rpm
      - /bin/snapd
      - /usr/bin/snapd
      - /bin/yum
      - /usr/bin/yum
      - /bin/dnf
      - /usr/bin/dnf
      - /bin/podman
      - /usr/bin/podman
      - /bin/dnf-automatic
      - /usr/bin/dnf-automatic
      - /bin/pacman
      - /usr/bin/pacman
      - /usr/bin/dpkg-divert
      - /bin/dpkg-divert
      - /sbin/apk
      - /usr/sbin/apk
      - /usr/local/sbin/apk
      - /usr/bin/apt
      - /usr/sbin/pacman
      - /usr/bin/puppet
      - /bin/puppet
      - /opt/puppetlabs/puppet/bin/puppet
      - /usr/bin/chef-client
      - /bin/chef-client
      - /bin/autossl_check
      - /usr/bin/autossl_check
      - /proc/self/exe
      - /dev/fd/*
      - /usr/bin/pamac-daemon
      - /bin/pamac-daemon
      - /usr/local/bin/dockerd
  filter2:
    file.extension|contains:
      - swp
      - swpx
      - swx
      - dpkg-remove
  filter3:
    file.Ext.original.extension:
      - dpkg-new
  filter4:
    process.executable|contains:
      - /nix/store/*
      - /var/lib/dpkg/*
      - /tmp/vmis.*
      - /snap/*
      - /dev/fd/*
  filter5:
    process.executable|contains:
      - 'null'
  filter6:
    process.name|contains:
      - sed
    file.name|contains:
      - sed
  filter7:
    process.name|contains:
      - perl
    file.name|contains:
      - e2scrub_all.tmp
