id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Bash Shell Profile Modification
description: >-
  Both bash_profile and bashrc are files containing shell commands that are run
  when Bash is invoked. These files are executed in a users context, either
  interactively or non-interactively, when a user logs in so that their
  environment is set correctly. Adversaries may abuse this to establish
  persistence by executing malicious content triggered by a users shell.
tags:
  - attack.persistence
  - attack.TA0003
  - attack.t1546
  - attack.t1546.004
  - attack.auditbeat
falsepositives:
  - >-
    Changes to the Shell Profile tend to be noisy, a tuning per your environment
    will be required
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: selection and not (filter1 or filter2)
  selection:
    event.category|contains:
      - file
    event.type|contains:
      - change
    file.path|contains:
      - /private/etc/rc.local
      - /etc/rc.local
      - /home/*/.profile
      - /home/*/.profile1
      - /home/*/.bash_profile
      - /home/*/.bash_profile1
      - /home/*/.bashrc
      - /Users/*/.bash_profile
      - /Users/*/.zshenv
  filter1:
    process.name|contains:
      - sudo
      - vim
      - zsh
      - env
      - nano
      - bash
      - Terminal
      - xpcproxy
      - login
      - cat
      - cp
      - launchctl
      - java
      - dnf
      - tailwatchd
      - ldconfig
      - yum
      - semodule
      - cpanellogd
      - dockerd
      - authselect
      - chmod
      - dnf-automatic
      - git
      - dpkg
      - platform-python
  filter2:
    process.executable|contains:
      - /Applications/*
      - /private/var/folders/*
      - /usr/local/*
      - /opt/saltstack/salt/bin/*
