id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Executable Bit Set for rc_local and rc_common
description: >-
  This rule monitors for the addition of an executable bit of the /etc/rc.local
  or /etc/rc.common files. These files are used to start custom applications,
  services, scripts or commands during start-up. They require executable
  permissions to be executed on boot. An alert of this rule is an indicator that
  this method is being set up within your environment. This method has mostly
  been replaced by Systemd. However, through the systemd-rc-local-generator,
  these files can be converted to services that run at boot. Adversaries may
  alter these files to execute malicious code at start-up, and gain persistence
  onto the system.
tags:
  - attack.persistence
  - attack.TA0003
  - attack.t1037
  - attack.t1037.004
falsepositives: []
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: selection and (filter1 or filter2)
  selection:
    host.os.type|all:
      - linux
    event.type|all:
      - start
    event.action|contains:
      - exec
      - exec_event
      - executed
    process.args|contains:
      - /etc/rc.local
      - /etc/rc.common
  filter1:
    process.name|all:
      - chmod
    process.args|contains:
      - +x
      - '1'
      - '3'
      - '5'
      - '7'
  filter2:
    process.name|all:
      - install
    process.args|all:
      - '-m'
    process.args|contains:
      - '7'
      - '5'
      - '3'
      - '1'
