id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Message of the Day MOTD File Creation
description: >-
  This rule detects the creation of potentially malicious files within the
  default MOTD file directories. Message of the day MOTD is the message that is
  presented to the user when a user connects to a Linux server via SSH or a
  serial connection. Linux systems contain several default MOTD files located in
  the /etc/update-motd.d/ directory. These scripts run as the root user every
  time a user connects over SSH or a serial connection. Adversaries may create
  malicious MOTD files that grant them persistence onto the target every time a
  user connects to the system by executing a backdoor script or command.
tags:
  - attack.persistence
  - attack.TA0003
  - attack.t1037
falsepositives: []
level: medium
status: experimental
arthor: hoang.nguyen
detection:
  condition: >-
    selection and not (filter1 or filter2 or filter3 or filter4 or filter5 or
    filter6 or filter7)
  selection:
    host.os.type:
      - linux
    event.action|contains:
      - rename
      - creation
      - create
    file.path|contains:
      - /etc/update-motd.d/*
  filter1:
    process.executable|contains:
      - /bin/dpkg
      - /usr/bin/dpkg
      - /bin/dockerd
      - /usr/bin/dockerd
      - /usr/sbin/dockerd
      - /bin/microdnf
      - /usr/bin/microdnf
      - /bin/rpm
      - /usr/bin/rpm
      - /bin/snapd
      - /usr/bin/snapd
      - /bin/yum
      - /usr/bin/yum
      - /bin/dnf
      - /usr/bin/dnf
      - /bin/podman
      - /usr/bin/podman
      - /bin/dnf-automatic
      - /usr/bin/dnf-automatic
      - /bin/pacman
      - /usr/bin/pacman
      - /usr/bin/dpkg-divert
      - /bin/dpkg-divert
      - /sbin/apk
      - /usr/sbin/apk
      - /usr/local/sbin/apk
      - /usr/bin/apt
      - /usr/sbin/pacman
      - /usr/bin/puppet
      - /bin/puppet
      - /opt/puppetlabs/puppet/bin/puppet
      - /usr/bin/chef-client
      - /bin/chef-client
      - /bin/autossl_check
      - /usr/bin/autossl_check
      - /proc/self/exe
      - /dev/fd/*
      - /usr/bin/pamac-daemon
      - /bin/pamac-daemon
      - /usr/lib/snapd/snapd
      - /usr/local/bin/dockerd
  filter2:
    file.extension|contains:
      - swp
      - swpx
      - swx
      - dpkg-remove
  filter3:
    file.extension:
      - dpkg-new
  filter4:
    process.executable|contains:
      - /nix/store/*
      - /var/lib/dpkg/*
      - /tmp/vmis.*
      - /snap/*
      - /dev/fd/*
      - /usr/lib/virtualbox/*
  filter5:
    process.executable:
      - 'null'
  filter6:
    process.name:
      - sed
    file.name:
      - sed*
  filter7:
    process.name:
      - perl
    file.name|contains:
      - e2scrub_all.tmp*
