id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Network Connection Initiated by SSHD Child Process
description: >-
  This rule identifies an egress internet connection initiated by an SSH Daemon
  child process. This behavior is indicative of the alteration of a shell
  configuration file or other mechanism that launches a process when a new SSH
  login occurs. Attackers can also backdoor the SSH daemon to allow for
  persistence, call out to a C2 or to steal credentials.
tags:
  - attack.persistence
  - attack.command_and_control
  - attack.lateral_movement
  - attack.t1546
  - attack.t1546.004
  - attack.t1021
  - attack.t1021.004
  - attack.t1563
  - attack.t1563.001
falsepositives: []
level: medium
status: experimental
references:
  - 'https://attack.mitre.org/techniques/T1546/'
  - 'https://attack.mitre.org/techniques/T1021/'
  - 'https://attack.mitre.org/techniques/T1563/'
author: hoang.nguyen
detection:
  condition: selection1 and not selection2
  selection1:
    host.os.type:
      - linux
    event.type:
      - start
    event.action|contains:
      - exec
      - connection_attempted
      - connected-to
      - executed
    process.executable:
      - /usr/sbin/sshd
  selection2:
    destination.ip|contains:
      - 0.0.0.0
      - 10.0.0.0/8
      - 127.0.0.0/8
      - 169.254.0.0/16
      - 172.16.0.0/12
      - 192.0.0.0/24
      - 192.0.0.0/29
      - 192.0.0.8/32
      - 192.0.0.9/32
      - 192.0.0.10/32
      - 192.0.0.170/32
      - 192.0.0.171/32
      - 192.0.2.0/24
      - 192.31.196.0/24
      - 192.52.193.0/24
      - 192.168.0.0/16
      - 192.88.99.0/24
      - 224.0.0.0/4
      - 100.64.0.0/10
      - 192.175.48.0/24
      - 198.18.0.0/15
      - 198.51.100.0/24
      - 203.0.113.0/24
      - 240.0.0.0/4
      - '::1'
      - 'FE80::/10'
      - 'FF00::/8'
      - 172.31.0.0/16
