id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Persistence via KDE AutoStart or Desktop file
description: >-
  Identifies the creation or modification of a K Desktop Environment (KDE)
  AutoStart script or desktop file that will execute upon each user logon.
  Adversaries may abuse this method for persistence.
tags:
  - attack.persistence
  - attack.TA0003
  - attack.t1547
falsepositives:
  - >-
    Legitimate use of creating or modifying KDE AutoStart scripts or desktop
    files by system administrators or automated tools
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: selection and not filter1
  selection:
    host.os.type|all:
      - linux
    file.extension|contains:
      - sh
      - desktop
    file.path|contains:
      - /home/*/.config/autostart/*
      - /root/.config/autostart/*
      - /home/*/.kde/Autostart/*
      - /root/.kde/Autostart/*
      - /home/*/.kde4/Autostart/*
      - /root/.kde4/Autostart/*
      - /home/*/.kde/share/autostart/*
      - /root/.kde/share/autostart/*
      - /home/*/.kde4/share/autostart/*
      - /root/.kde4/share/autostart/*
      - /home/*/.local/share/autostart/*
      - /root/.local/share/autostart/*
      - /home/*/.config/autostart-scripts/*
      - /root/.config/autostart-scripts/*
      - /etc/xdg/autostart/*
      - /usr/share/autostart/*
  filter1:
    process.name|contains:
      - yum
      - dpkg
      - install
      - dnf
      - teams
      - yum-cron
      - dnf-automatic
      - docker
      - dockerd
      - rpm
      - pacman
      - podman
      - nautilus
      - remmina
      - cinnamon-settings.py
    event.type|contains:
      - deletion
      - delete
