id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Potential Linux Backdoor User Account Creation
description: >-
  Identifies the attempt to create a new backdoor user by setting the users UID to 0. Attackers may alter a users UID to 0 to establish persistence on a system.
tags:
  - attack.persistence
  - attack.TA0003
  - attack.t1136
  - attack.t1136.001
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: selection
  selection:
    host.os.type|all:
      - linux
    event.type|all:
      - start
    event.action|contains:
      - exec
      - exec_event
      - executed
      - process_started
    process.name|contains:
      - usermod
    process.args|contains:
      - '-u'
      - '0'
      - '-o'
falsepositives:
  - Legitimate use of usermod to modify user accounts by system administrators or automated tools