id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Potential Persistence Through init_d Detected
description: >-
  Files that are placed in the /etc/init.d/ directory in Unix can be used to
  start custom applications, services, scripts or commands during start-up.
  Init.d has been mostly replaced in favor of Systemd. However, the
  systemd-sysv-generator can convert init.d files to service unit files that run
  at boot. Adversaries may add or alter files located in the /etc/init.d/
  directory to execute malicious code upon boot in order to gain persistence on
  the system.
tags:
  - attack.persistence
  - attack.TA0003
  - attack.t1037
falsepositives:
  - >-
    Files that are placed in the /etc/init.d/ directory in Unix can be used to
    start custom applications, services, scripts or commands during start-up.
    Init.d has been mostly replaced in favor of Systemd. However, the
    "systemd-sysv-generator" can convert init.d files to service unit files that
    run at boot. Adversaries may add or alter files located in the /etc/init.d/
    directory to execute malicious code upon boot in order to gain persistence
    on the system.
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: selection and not (filter1 or filter2 or filter3 or filter4 or filter5)
  selection:
    host.os.type|all:
      - linux
    event.action|contains:
      - creation
      - file_create_event
      - rename
      - file_rename_event
      - create
    file.path|contains:
      - /etc/init.d/*
  filter1:
    process.name|contains:
      - dpkg
      - dockerd
      - rpm
      - dnf
      - chef-client
      - apk
      - yum
      - rpm
      - vmis-launcher
      - exe
      - platform-python
      - executor
      - podman
  filter2:
    file.extension|contains:
      - swp
      - swpx
  filter3:
    process.name|contains:
      - mv
    file.name|contains:
      - '*.dpkg-remove'
  filter4:
    process.name|all:
      - sed
    file.name|all:
      - sed*
  filter5:
    process.name|all:
      - systemd
    file.name|contains:
      - '*.dpkg-new'
