id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Setcap setuid or setgid Capability Set
description: >-
  This rule monitors for the addition of the cap_setuid ep or cap_setgid ep
  capabilities via setcap. Setuid (Set User ID) and setgid (Set Group ID) are
  Unix-like OS features that enable processes to run with elevated privileges,
  based on the file owner or group. Threat actors can exploit these attributes
  to achieve persistence by creating malicious binaries, allowing them to
  maintain control over a compromised system with elevated permissions.
tags:
  - attack.persistence
  - attack.TA0003
  - attack.TA0004
  - attack.T1548
  - attack.t1548.001
falsepositives:
  - >-
    Legitimate use of setcap to set capabilities by system administrators or
    automated tools
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: selection and not filter1
  selection:
    host.os.type:
      - linux
    event.type:
      - start
    event.action|contains:
      - exec
      - exec_event
      - executed
    process.name:
      - setcap
    process.args:
      - cap_set?id+ep
  filter1:
    process.name|contains:
      - jem
      - vzctl
