id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Shared Object Created or change by Unknown Process
description: >-
  This rule monitors the creation of shared object files by previously unknown
  processes. The creation of a shared object file involves compiling code into a
  dynamically linked library that can be loaded by other programs at runtime.
  While this process is typically used for legitimate purposes, malicious actors
  can leverage shared object files to execute unauthorized code, inject
  malicious functionality into legitimate processes, or bypass security
  controls. This allows malware to persist on the system, evade detection, and
  potentially compromise the integrity and confidentiality of the affected
  system and its data.
tags:
  - attack.persistence
  - attack.TA0003
  - attack.T1574
  - attack.t1574.006
falsepositives:
  - >-
    Legitimate use of shared object creation by system administrators or
    automated tools
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: selection and not (filter1 or filter2)
  selection:
    host.os.type:
      - linux
    event.action|contains:
      - creation
      - file_create_event
      - file_rename_event
      - rename
      - create
    file.path|contains:
      - /dev/shm/*
      - /usr/lib/*
    file.extension:
      - so
  filter1:
    process.name|contains:
      - dockerd
      - dpkg
      - rpm
      - snapd
      - yum
      - vmis-launcher
      - pacman
      - apt-get
      - dnf
      - podman
      - platform-python
  filter2:
    process.name|contains:
      - vmware-install.pl
    file.path|contains:
      - /usr/lib/vmware-tools/*
