id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Systemd-udevd Rule File Creation
description: >-
  Monitors for the creation of rule files that are used by systemd-udevd to
  manage device nodes and handle kernel device events in the Linux operating
  system. Systemd-udevd can be exploited for persistence by adversaries by
  creating malicious udev rules that trigger on specific events, executing
  arbitrary commands or payloads whenever a certain device is plugged in or
  recognized by the system.
tags:
  - attack.persistence
  - attack.t1037
  - attack.TA0003
falsepositives: []
level: low
status: experimental
references:
  - 'https://attack.mitre.org/techniques/T1037/'
author: hoang.nguyen
detection:
  condition: >-
    selection and not (filter1 or filter2 or filter3 or filter4 or filter5 or
    filter6)
  selection:
    host.os.type:
      - linux
    event.action|contains:
      - rename
      - creation
      - create
    file.path|contains:
      - /lib/udev/*
      - /etc/udev/rules.d/*
      - /usr/lib/udev/rules.d/*
      - /run/udev/rules.d/*
    process.executable:
      - '*'
  filter1:
    process.executable|contains:
      - /bin/dpkg
      - /usr/bin/dpkg
      - /bin/dockerd
      - /usr/bin/dockerd
      - /usr/sbin/dockerd
      - /bin/microdnf
      - /usr/bin/microdnf
      - /bin/rpm
      - /usr/bin/rpm
      - /bin/snapd
      - /usr/bin/snapd
      - /bin/yum
      - /usr/bin/yum
      - /bin/dnf
      - /usr/bin/dnf
      - /bin/podman
      - /usr/bin/podman
      - /bin/dnf-automatic
      - /usr/bin/dnf-automatic
      - /bin/pacman
      - /usr/bin/pacman
      - /usr/bin/dpkg-divert
      - /bin/dpkg-divert
      - /sbin/apk
      - /usr/sbin/apk
      - /usr/local/sbin/apk
      - /usr/bin/apt
      - /usr/sbin/pacman
      - /usr/bin/puppet
      - /bin/puppet
      - /opt/puppetlabs/puppet/bin/puppet
      - /usr/bin/chef-client
      - /bin/chef-client
      - /bin/autossl_check
      - /usr/bin/autossl_check
      - /proc/self/exe
      - /dev/fd/*
      - /usr/bin/pamac-daemon
      - /bin/pamac-daemon
      - /usr/lib/snapd/snapd
      - /usr/local/bin/dockerd
      - /usr/libexec/netplan/generate
  filter2:
    file.extension|contains:
      - swp
      - swpx
      - swx
      - dpkg-remove
  filter3:
    file.extension:
      - dpkg-new
  filter4:
    process.executable|contains:
      - /nix/store/*
      - /var/lib/dpkg/*
      - /snap/*
      - /dev/fd/*
      - /usr/lib/*
      - /usr/libexec/*
  filter5:
    process.name:
      - sed
    file.name:
      - sed*
  filter6:
    process.name:
      - perl
    file.name:
      - e2scrub_all.tmp*
