id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Systemd Service Created
description: >-
  This rule detects the creation or renaming of a new Systemd file in all of the
  common Systemd service locations for both root and regular users. Systemd
  service files are configuration files in Linux systems used to define and
  manage system services. Malicious actors can leverage systemd service files to
  achieve persistence by creating or modifying services to execute malicious
  commands or payloads during system startup or at a predefined interval by
  adding a systemd timer. This allows them to maintain unauthorized access,
  execute additional malicious activities, or evade detection.
tags:
  - attack.persistence
  - attack.privilege_escalation
  - attack.TA0003
  - attack.TA0004
  - attack.t1543
  - attack.t1543.002
falsepositives: []
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: >-
    selection and not (filter1 or filter2 or filter3 or filter4 or filter5 or
    filter6 or filter7)
  selection:
    host.os.type|all:
      - linux
    event.action|contains:
      - rename
      - creation
      - create
    file.path|contains:
      - /etc/systemd/system/*
      - /usr/local/lib/systemd/system/*
      - /lib/systemd/system/*
      - /usr/lib/systemd/system/*
      - /home/*/.config/systemd/user/*
      - /home/*/.local/share/systemd/user/*
      - /root/.config/systemd/user/*
      - /root/.local/share/systemd/user/*
    file.extension|contains:
      - service
  filter1:
    process.executable|contains:
      - /bin/dpkg
      - /usr/bin/dpkg
      - /bin/dockerd
      - /usr/bin/dockerd
      - /usr/sbin/dockerd
      - /bin/microdnf
      - /usr/bin/microdnf
      - /bin/rpm
      - /usr/bin/rpm
      - /bin/snapd
      - /usr/bin/snapd
      - /bin/yum
      - /usr/bin/yum
      - /bin/dnf
      - /usr/bin/dnf
      - /bin/podman
      - /usr/bin/podman
      - /bin/dnf-automatic
      - /usr/bin/dnf-automatic
      - /bin/pacman
      - /usr/bin/pacman
      - /usr/bin/dpkg-divert
      - /bin/dpkg-divert
      - /sbin/apk
      - /usr/sbin/apk
      - /usr/local/sbin/apk
      - /usr/bin/apt
      - /usr/sbin/pacman
      - /usr/bin/puppet
      - /bin/puppet
      - /opt/puppetlabs/puppet/bin/puppet
      - /usr/bin/chef-client
      - /bin/chef-client
      - /bin/autossl_check
      - /usr/bin/autossl_check
      - /proc/self/exe
      - /dev/fd/*
      - /usr/bin/pamac-daemon
      - /bin/pamac-daemon
      - /usr/lib/snapd/snapd
      - /usr/local/bin/dockerd
  filter2:
    file.extension|contains:
      - swp
      - swpx
      - swx
      - dpkg-remove
  filter3:
    file.extension|all:
      - dpkg-new
  filter4:
    process.executable|contains:
      - /nix/store/*
      - /var/lib/dpkg/*
      - /tmp/vmis.*
      - /snap/*
      - /dev/fd/*
      - /usr/lib/virtualbox/*
  filter5:
    process.executable:
      - 'null'
  filter6:
    process.name|all:
      - sed
    file.name|contains:
      - sed*
  filter7:
    process.name|all:
      - perl
    file.name|contains:
      - e2scrub_all.tmp*
