id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Systemd Timer Created
description: >-
  Detects the creation of a systemd timer within any of the default systemd
  timer directories. Systemd timers can be used by an attacker to gain
  persistence, by scheduling the execution of a command or script. Similarly to
  cron/at, systemd timers can be set up to execute on boot time, or on a
  specific point in time, which allows attackers to regain access in case the
  connection to the infected asset was lost.
tags:
  - attack.persistence
  - attack.TA0003
  - attack.t1053
  - attack.t1053.006
falsepositives: []
level: low
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: >-
    selection and not (filter1 or filter2 or filter3 or filter4 or filter5 or
    filter6 or filter7)
  selection:
    host.os.type|all:
      - linux
    event.action|contains:
      - rename
      - creation
      - create
    file.path|contains:
      - /etc/systemd/system/*
      - /usr/local/lib/systemd/system/*
      - /lib/systemd/system/*
      - /usr/lib/systemd/system/*
      - /home/*/.config/systemd/user/*
      - /home/*/.local/share/systemd/user/*
      - /root/.config/systemd/user/*
      - /root/.local/share/systemd/user/*
    file.extension|all:
      - timer
  filter1:
    process.executable|contains:
      - /bin/dpkg
      - /usr/bin/dpkg
      - /bin/dockerd
      - /usr/bin/dockerd
      - /usr/sbin/dockerd
      - /bin/microdnf
      - /usr/bin/microdnf
      - /bin/rpm
      - /usr/bin/rpm
      - /bin/snapd
      - /usr/bin/snapd
      - /bin/yum
      - /usr/bin/yum
      - /bin/dnf
      - /usr/bin/dnf
      - /bin/podman
      - /usr/bin/podman
      - /bin/dnf-automatic
      - /usr/bin/dnf-automatic
      - /bin/pacman
      - /usr/bin/pacman
      - /usr/bin/dpkg-divert
      - /bin/dpkg-divert
      - /sbin/apk
      - /usr/sbin/apk
      - /usr/local/sbin/apk
      - /usr/bin/apt
      - /usr/sbin/pacman
      - /usr/bin/puppet
      - /bin/puppet
      - /opt/puppetlabs/puppet/bin/puppet
      - /usr/bin/chef-client
      - /bin/chef-client
      - /bin/autossl_check
      - /usr/bin/autossl_check
      - /proc/self/exe
      - /dev/fd/*
      - /usr/bin/pamac-daemon
      - /bin/pamac-daemon
      - /usr/lib/snapd/snapd
      - /usr/local/bin/dockerd
  filter2:
    file.extension|contains:
      - swp
      - swpx
      - swx
      - dpkg-remove
  filter3:
    file.extension|all:
      - dpkg-new
  filter4:
    process.executable|contains:
      - /nix/store/*
      - /var/lib/dpkg/*
      - /tmp/vmis.*
      - /snap/*
      - /dev/fd/*
      - /usr/lib/virtualbox/*
  filter5:
    process.executable:
      - 'null'
  filter6:
    process.name|all:
      - sed
    file.name|contains:
      - sed*
  filter7:
    process.name|all:
      - perl
    file.name|contains:
      - e2scrub_all.tmp*
