id: ""
logsource:
  product: linux
title: Sensitive Files Compression
description: >-
  Identifies the use of a compression utility to collect known files containing
  sensitive information, such as credentials and system configurations. 
tags:
  - attack.Credential_Access
  - attack.TA0006
  - attack.T1552
  - attack.T1552.001
  - attack.Collection
  - attack.T1560
  - attack.TA0009
  - attack.T1560.001
falsepositives: []
level: medium
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0006/'
  - 'https://attack.mitre.org/techniques/T1552/'
  - 'https://attack.mitre.org/techniques/T1552/001/'
  - 'https://attack.mitre.org/tactics/TA0009/'
  - 'https://attack.mitre.org/techniques/T1560/'
  - 'https://attack.mitre.org/techniques/T1560/001/'
author: hoang.nguyen
detection:
  condition: Selection_1 and Selection_2 and Selection_3 and Selection_4 and Selection_5
  Selection_1:
    event.category|contains:
      - process
  Selection_2:
    host.os.type|all:
      - linux
  Selection_3:
    event.type|contains:
      - start
  Selection_4:
    process.name|contains:
      - zip
      - tar
      - gzip
      - hdiutil
      - 7z
  Selection_5:
    process.args|contains:
      - /root/.ssh/id_rsa
      - /root/.ssh/id_rsa.pub
      - /root/.ssh/id_ed25519
      - /root/.ssh/id_ed25519.pub
      - /root/.ssh/authorized_keys
      - /root/.ssh/authorized_keys2
      - /root/.ssh/known_hosts
      - /root/.bash_history
      - /etc/hosts
      - /home/*/.ssh/id_rsa
      - /home/*/.ssh/id_rsa.pub
      - /home/*/.ssh/id_ed25519
      - /home/*/.ssh/id_ed25519.pub
      - /home/*/.ssh/authorized_keys
      - /home/*/.ssh/authorized_keys2
      - /home/*/.ssh/known_hosts
      - /home/*/.bash_history
      - /root/.aws/credentials
      - /root/.aws/config
      - /home/*/.aws/credentials
      - /home/*/.aws/config
      - /root/.docker/config.json
      - /home/*/.docker/config.json
      - /etc/group
      - /etc/passwd
      - /etc/shadow
      - /etc/gshadow