id: ""
logsource:
  product: linux
title: Account or Group Discovery via Built-In Tools
description: >-
  Adversaries may use built-in applications to get a listing of local system or
  domain accounts and groups.
tags:
  - attack.Discovery
  - attack.TA0007
  - attack.T1069
  - attack.T1069.001
  - attack.T1069.002
  - attack.T1087
  - attack.T1087.001
  - attack.T1087.002
  - attack.auditbeat
falsepositives: []
level: low
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0007/'
  - 'https://attack.mitre.org/techniques/T1069/'
  - 'https://attack.mitre.org/techniques/T1069/001/'
  - 'https://attack.mitre.org/techniques/T1069/002/'
  - 'https://attack.mitre.org/techniques/T1087/'
  - 'https://attack.mitre.org/techniques/T1087/001/'
  - 'https://attack.mitre.org/techniques/T1087/002/'
author: hoang.nguyen
detection:
  condition: >-
    Selection_1 and Selection_2 and (Selection_3 or (Selection_4 and
    Selection_5) or (Selection_6 and Selection_7) or Selection_8 or (Selection_9
    and Selection_10))
  Selection_1:
    event.type|all:
      - start
  Selection_2:
    event.action|contains:
      - exec
      - exec_event
      - executed
      - process_started
  Selection_3:
    process.name|contains:
      - groups
      - id
  Selection_4:
    process.name|all:
      - dscl
  Selection_5:
    process.args|contains:
      - /Active Directory/*
      - /Users*
      - /Groups*
  Selection_6:
    process.name|all:
      - dscacheutil
  Selection_7:
    process.args|contains:
      - user
      - group
  Selection_8:
    process.args|contains:
      - /etc/passwd
      - /etc/master.passwd
      - /etc/sudoers
  Selection_9:
    process.name|all:
      - getent
  Selection_10:
    process.args|contains:
      - passwd
      - group