id: ""
logsource:
  product: linux
title: Discovery of Domain Groups
description: >-
  Identifies the execution of Linux built-in commands related to account or
  group enumeration.
tags:
  - attack.Discovery
  - attack.TA0007
  - attack.T1069
  - attack.auditbeat
falsepositives: []
level: low
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0007/'
  - 'https://attack.mitre.org/techniques/T1069/'
author: hoang.nguyen
detection:
  condition: >-
    Selection_1 and Selection_2 and Selection_3 and (Selection_4 or (Selection_5
    and Selection_6))
  Selection_1:
    host.os.type|all:
      - linux
  Selection_2:
    event.type|all:
      - start
  Selection_3:
    event.action|contains:
      - exec
      - exec_event
      - executed
      - process_started
  Selection_4:
    process.name|contains:
      - ldapsearch
      - dscacheutil
  Selection_5:
    process.name|all:
      - dscl
  Selection_6:
    process.args|contains:
      - '-list'