id: ""
logsource:
  product: linux
title: Enumeration of Kernel Modules via Proc
description: >-
  Loadable Kernel Modules (or LKMs) are pieces of code that can be loaded and
  unloaded into the kernel upon demand.
tags:
  - attack.Discovery
  - attack.TA0007
  - attack.T1082
  - attack.auditbeat
falsepositives: []
level: low
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0007/'
  - 'https://attack.mitre.org/techniques/T1082/'
author: hoang.nguyen
detection:
  condition: Selection_1 and Selection_2 and Selection_3 and not Selection_5
  Selection_1:
    host.os.type|all:
      - linux
  Selection_2:
    event.category|all:
      - file
  Selection_3:
    event.action|all:
      - opened-file
  Selection_5:
    process.name|contains:
      - grep
      - python*
      - chef-client