id: ""
logsource:
  product: linux
title: ESXI Discovery via Find
description: >-
  Identifies instances where the find command is started on a Linux system with
  arguments targeting specific VM-related paths
tags:
  - attack.Discovery
  - attack.TA0007
  - attack.T1518
  - attack.auditbeat
falsepositives: []
level: medium
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0007/'
  - 'https://attack.mitre.org/techniques/T1518/'
author: hoang.nguyen
detection:
  condition: Selection_1 and Selection_2 and Selection_3 and Selection_4 and Selection_5
  Selection_1:
    host.os.type|all:
      - linux
  Selection_2:
    event.type|all:
      - start
  Selection_3:
    event.action|contains:
      - exec
      - exec_event
      - executed
      - process_started
  Selection_4:
    process.name|all:
      - find
  Selection_5:
    process.args|contains:
      - /etc/vmware/*
      - /usr/lib/vmware/*
      - /vmfs/*