id: ""
logsource:
  product: linux
title: Linux System Information Discovery
description: >-
  Enrich process events with uname and other command lines that imply Linux
  system information discovery.
tags:
  - attack.Discovery
  - attack.TA0007
  - attack.T1082
  - attack.auditbeat
falsepositives: []
level: low
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0007/'
  - 'https://attack.mitre.org/techniques/T1082/'
author: hoang.nguyen
detection:
  condition: >-
    Selection_1 and Selection_2 and (Selection_3 or (Selection_4 and
    Selection_5))
  Selection_1:
    event.type|all:
      - start
  Selection_2:
    event.action|contains:
      - exec
      - exec_event
      - executed
      - process_started
  Selection_3:
    process.name|all:
      - uname
  Selection_4:
    process.name|contains:
      - cat
      - more
      - less
  Selection_5:
    process.args|contains:
      - '*issue*'
      - '*version*'
      - '*profile*'
      - '*services*'
      - '*cpuinfo*'