id: ""
logsource:
  product: linux
title: Network Traffic Capture via CAP_NET_RAW
description: >-
  Identifies the ability of a process to be able to create RAW and PACKET socket
  types for the available network namespaces by a non-root user.
tags:
  - attack.Discovery
  - attack.TA0007
  - attack.T1040
  - attack.auditbeat
falsepositives: []
level: low
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0007/'
  - 'https://attack.mitre.org/techniques/T1040/'
author: hoang.nguyen
detection:
  condition: >-
    Selection_1 and Selection_2 and Selection_5
    and (Selection_6 or Selection_7) and not Selection_8
  Selection_1:
    event.category|all:
      - process
  Selection_2:
    host.os.type|all:
      - linux
  Selection_5:
    process.name|contains:
      - '*'
  Selection_6:
    process.thread.capabilities.effective|all:
      - CAP_NET_RAW
  Selection_7:
    process.thread.capabilities.permitted|all:
      - CAP_NET_RAW
  Selection_8:
    user.id|all:
      - '0'