id: ""
logsource:
  product: linux
title: Nping Process Activity
description: Nping ran on a Linux host.
tags:
  - attack.Discovery
  - attack.TA0007
  - attack.T1046
  - attack.auditbeat
falsepositives: []
level: medium
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0007/'
  - 'https://attack.mitre.org/techniques/T1046/'
author: hoang.nguyen
detection:
  condition: Selection_1 and Selection_3 and Selection_4
  Selection_1:
    host.os.type|all:
      - linux
  Selection_3:
    event.action|contains:
      - exec
      - exec_event
      - executed
      - process_started
  Selection_4:
    process.name|contains:
      - nping