id: ""
logsource:
  product: linux
title: Potential Pspy Process Monitoring Detected
description: >-
  This rule leverages auditd to monitor for processes scanning different
  processes within the /proc directory using the openat syscall.
tags:
  - attack.Discovery
  - attack.TA0007
  - attack.T1057
  - attack.T1082
  - attack.auditbeat
falsepositives: []
level: low
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0007/'
  - 'https://attack.mitre.org/techniques/T1057/'
  - 'https://attack.mitre.org/techniques/T1082/'
author: hoang.nguyen
detection:
  condition: Selection_1 and Selection_2 and Selection_4 and Selection_5
  Selection_1:
    host.os.type|all:
      - linux
  Selection_2:
    auditd.data.syscall|all:
      - openat
  Selection_4:
    auditd.data.a0|contains:
      - ffffffffffffff9c
      - ffffff9c
  Selection_5:
    auditd.data.a2|contains:
      - '80000'
      - '88000'