id: ""
logsource:
  product: linux
title: Potential Memory Seeking Activity
description: >-
  Monitors for the execution of Unix utilities that may be leveraged as memory
  address seekers.
tags:
  - attack.Discovery
  - attack.TA0007
  - attack.T1057
falsepositives: []
level: low
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0007/'
  - 'https://attack.mitre.org/techniques/T1057/'
author: hoang.nguyen
detection:
  condition: >-
    Selection_1 and Selection_2 and Selection_3 and (Selection_4 or Selection_5
    or (Selection_6 and Selection_7) or (Selection_8 and Selection_9))
  Selection_1:
    host.os.type|all:
      - linux
  Selection_2:
    event.type|contains:
      - start
  Selection_3:
    event.action|contains:
      - exec
      - exec_event
      - executed
  Selection_4:
    process.name|all:
      - tail
    process.args|all:
      - '-c'
  Selection_5:
    process.name|all:
      - cmp
    process.args|all:
      - '-i'
  Selection_6:
    process.name|contains:
      - hexdump
      - xxd
  Selection_7:
    process.args|all:
      - '-s'
  Selection_8:
    process.name|all:
      - dd
  Selection_9:
    process.args|startswith:
      - skip
      - seek