id: ""
logsource:
  product: linux
title: Potential Network Scan Executed From Host
description: >-
  This threshold rule monitors for the rapid execution of unix utilities that
  are capable of conducting network scans.
tags:
  - attack.Discovery
  - attack.TA0007
  - attack.T1046
  - attack.auditbeat
falsepositives: []
level: medium
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0007/'
  - 'https://attack.mitre.org/techniques/T1046/'
author: hoang.nguyen
detection:
  condition: Selection_1 and Selection_2 and Selection_3 and Selection_4 and Selection_5
  Selection_1:
    event.category|all:
      - process
  Selection_2:
    host.os.type|all:
      - linux
  Selection_3:
    event.action|contains:
      - exec
      - exec_event
      - executed
      - process_started
  Selection_4:
    event.type|contains:
      - start
  Selection_5:
    process.name|contains:
      - ping
      - nping
      - hping
      - hping2
      - hping3
      - nc
      - ncat
      - netcat
      - socat