id: ""
logsource:
  product: linux
title: Process Capability Enumeration
description: >-
  Identifies recursive process capability enumeration of the entire filesystem
  through the getcap command. Malicious users may manipulate identified
  capabilities to gain root privileges.
tags:
  - attack.Discovery
  - attack.TA0007
  - attack.T1057
  - attack.auditbeat
falsepositives: []
level: low
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0007/'
  - 'https://attack.mitre.org/techniques/T1057/'
author: hoang.nguyen
detection:
  condition: >-
    Selection_1 and Selection_2 and Selection_3 and Selection_4 and Selection_5
    and Selection_6 and not Selection_8
  Selection_1:
    host.os.type|all:
      - linux
  Selection_2:
    event.type|contains:
      - start
  Selection_3:
    event.action|contains:
      - exec
      - exec_event
      - executed
  Selection_4:
    process.name|contains:
      - getcap
  Selection_5:
    process.args|contains:
      - '-r'
  Selection_6:
    process.contains|all:
      - /
  Selection_8:
    user.id|all:
      - '0'