id: ""
logsource:
  product: linux
title: Sudo Command Enumeration Detected
description: >-
  This rule monitors for the usage of the sudo -l command, which is used to list
  the allowed and forbidden commands for the invoking user.
tags:
  - attack.Discovery
  - attack.TA0007
  - attack.T1033
  - attack.auditbeat
falsepositives: []
level: low
status: stable
references:
  - 'https://attack.mitre.org/tactics/TA0007/'
  - 'https://attack.mitre.org/techniques/T1033/'
author: Elastic
detection:
  condition: >-
    Selection_1 and Selection_2 and Selection_3 and Selection_4 and not Selection_10
  Selection_1:
    host.os.type|all:
      - linux
  Selection_2:
    event.type|contains:
      - start
  Selection_3:
    event.action|contains:
      - exec
      - executed
  Selection_4:
    process.name|contains|all:
      - sudo
      - '-l'
  Selection_10:
    process.args|contains:
      - dpkg