id: ""
logsource:
  product: linux
title: Suspicious Modprobe File Event
description: >-
  Detects file events involving kernel modules in modprobe configuration files,
  which may indicate unauthorized access or manipulation of critical kernel
  modules.
tags:
  - attack.Discovery
  - attack.TA0007
  - attack.T1082
  - attack.auditbeat
falsepositives: []
level: low
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0007/'
  - 'https://attack.mitre.org/techniques/T1082/'
author: hoang.nguyen
detection:
  condition: Selection_1 and Selection_2 and Selection_3 and not Selection_5
  Selection_1:
    host.os.type|all:
      - linux
  Selection_2:
    event.category|contains:
      - file
  Selection_3:
    event.action|all:
      - opened-file
  Selection_5:
    process.name|contains:
      - cp
      - dpkg
      - dockerd
      - lynis
      - mkinitramfs
      - snapd
      - systemd-udevd
      - grep
      - borg
      - auditbeat
      - lspci
      - aide
      - modprobe
      - python*