id: ""
logsource:
  product: linux
title: Suspicious Memory grep Activity
description: Monitors for grep activity related to memory mapping.
tags:
  - attack.Discovery
  - attack.TA0007
  - attack.T1057
  - attack.auditbeat
falsepositives: []
level: low
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0007/'
  - 'https://attack.mitre.org/techniques/T1057/'
author: hoang.nguyen
detection:
  condition: Selection_1 and Selection_2 and Selection_3 and Selection_4 and Selection_5
  Selection_1:
    host.os.type|all:
      - linux
  Selection_2:
    event.type|contains:
      - start
  Selection_3:
    event.action|contains:
      - exec
      - exec_event
      - executed
  Selection_4:
    process.name|contains:
      - grep
      - egrep
      - fgrep
      - rgrep
  Selection_5:
    process.args|contains:
      - '[stack]'
      - '[vdso]'
      - '[heap]'