id: ""
logsource:
  product: linux
title: Suspicious Sysctl File Event
description: >-
  Monitors file events on sysctl configuration files to identify potential
  unauthorized access or manipulation of system-level configuration settings.
tags:
  - attack.Discovery
  - attack.TA0007
  - attack.T1082
  - attack.auditbeat
falsepositives: []
level: low
status: stable
references:
  - 'https://attack.mitre.org/tactics/TA0007/'
  - 'https://attack.mitre.org/techniques/T1082/'
author: Elastic
detection:
  condition: >-
    Selection_1 and Selection_2 and Selection_3 and Selection_4 and not
    Selection_5
  Selection_1:
    host.os.type|all:
      - linux
  Selection_2:
    event.category|all:
      - file
  Selection_3:
    event.action|contains:
      - opened-file
      - read-file
      - wrote-to-file
  Selection_4:
    file.path|contains:
      - /etc/sysctl.conf
      - /etc/sysctl.d
      - /etc/sysctl.d/*
  Selection_5:
    process.name|contains:
      - dpkg
      - dockerd
      - unattended-upg
      - systemd-sysctl
      - python*
      - auditbeat
      - grep
      - pool*