id: ""
logsource:
  product: linux
title: Suspicious Dynamic Linker Discovery via od
description: Monitors for dynamic linker discovery via the od utility.
tags:
  - attack.Discovery
  - attack.TA0007
  - attack.T1057
  - attack.auditbeat
falsepositives: []
level: low
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0007/'
  - 'https://attack.mitre.org/techniques/T1057/'
author: hoang.nguyen
detection:
  condition: Selection_1 and Selection_2 and Selection_3 and Selection_4 and Selection_5
  Selection_1:
    host.os.type|all:
      - linux
  Selection_2:
    event.type|contains:
      - start
  Selection_3:
    event.action|contains:
      - exec
      - exec_event
      - executed
      - process_started
  Selection_4:
    process.name|all:
      - od
  Selection_5:
    process.args|contains:
      - /lib/x86_64-linux-gnu/ld-linux-x86-64.so.2
      - /etc/ld.so.preload
      - /lib64/ld-linux-x86-64.so.2
      - /usr/lib/x86_64-linux-gnu/ld-linux-x86-64.so.2
      - /usr/lib64/ld-linux-x86-64.so.2