id: ""
logsource:
  product: linux
title: System Owner_User Discovery Linux
description: >-
  Identifies the use of built-in tools which adversaries may use to enumerate
  the system owner/user of a compromised system.
tags:
  - attack.Discovery
  - attack.TA0007
  - attack.T1033
  - attack.T1069
  - attack.auditbeat
falsepositives: []
level: low
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0007/'
  - 'https://attack.mitre.org/techniques/T1033/'
  - 'https://attack.mitre.org/techniques/T1069/'
author: hoang.nguyen
detection:
  condition: Selection_1 and Selection_2 and Selection_3
  Selection_1:
    event.type|contains:
      - start
  Selection_2:
    event.action|contains:
      - exec
      - exec_event
      - executed
      - process_started
  Selection_3:
    process.name|contains:
      - whoami
      - w
      - who
      - users
      - id