id: ""
logsource:
  product: linux
title: System Hosts File Access
description: >-
  Identifies the use of built-in tools to read the contents of \etc\hosts on a
  local machine.
tags:
  - attack.Discovery
  - attack.TA0007
  - attack.T1018
  - attack.auditbeat
falsepositives: []
level: low
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0007/'
  - 'https://attack.mitre.org/techniques/T1018/'
author: hoang.nguyen
detection:
  condition: Selection_1 and Selection_2 and Selection_3 and Selection_4
  Selection_1:
    event.type|all:
      - start
  Selection_2:
    event.action|contains:
      - exec
      - exec_event
      - executed
      - process_started
  Selection_3:
    process.name|contains:
      - vi
      - nano
      - cat
      - more
      - less
  Selection_4:
    process.args|contains:
      - /etc/hosts