id: ""
logsource:
  product: linux
title: System Network Connections Discovery
description: >-
  Adversaries may attempt to get a listing of network connections to or from a
  compromised system.
tags:
  - attack.Discovery
  - attack.TA0007
  - attack.T1049
  - attack.auditbeat
falsepositives: []
level: low
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0007/'
  - 'https://attack.mitre.org/techniques/T1049/'
author: hoang.nguyen
detection:
  condition: Selection_1 and Selection_2 and Selection_3
  Selection_1:
    event.type|contains:
      - start
  Selection_2:
    event.action|contains:
      - exec
      - exec_event
      - executed
      - process_started
  Selection_3:
    process.name|contains:
      - netstat
      - lsof
      - who
      - w