any where event.type:"start" and (event.action like~ ("*exec*", "*exec_event*", "*executed*", "*process_started*")) and (process.name:"uname" or ((process.name like~ ("*cat*", "*more*", "*less*")) and (process.args like~ ("*issue*", "*version*", "*profile*", "*services*", "*cpuinfo*"))))
