id: ""
logsource:
  product: linux
title: Suspicious Network Tool Launched In A Container
description: >-
  This rule detects commonly abused network utilities running inside a
  container. Network utilities like nc, nmap, dig, tcpdump, ngrep, telnet,
  mitmproxy, zmap can be used for malicious purposes such as network
  reconnaissance, monitoring, or exploitation, and should be monitored closely
  within a container. 
tags:
  - attack.TA0007
  - attack.T1046
  - attack.TA0011
  - attack.T1105
  - attack.TA0043
  - attack.T1595
  - attack.Discovery
  - attack.Command_and_Control
  - attack.Reconnaissance
falsepositives:
  - >-
    here is a potential for false positives if the container is used for
    legitimate tasks that require the use of network utilities, such as network
    troubleshooting, testing or system monitoring. It is important to
    investigate any alerts generated by this rule to determine if they are
    indicative of malicious activity or part of legitimate container activity. 
level: medium
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0007/'
  - 'https://attack.mitre.org/techniques/T1046/'
  - 'https://attack.mitre.org/tactics/TA0011/'
  - 'https://attack.mitre.org/techniques/T1105/'
  - 'https://attack.mitre.org/tactics/TA0043/'
  - 'https://attack.mitre.org/techniques/T1595/'
author: hoang.nguyen
detection:
  condition: Selection_1 and (Selection_2 or Selection_3)
  Selection_1:
    event.type|all:
      - start
  Selection_2:
    process.name|contains:
      - nc
      - ncat
      - nmap
      - dig
      - nslookup
      - tcpdump
      - tshark
      - ngrep
      - telnet
      - mitmproxy
      - socat
      - zmap
      - masscan
      - zgrab
  Selection_3:
    process.args|contains:
      - nc
      - ncat
      - nmap
      - dig
      - nslookup
      - tcpdump
      - tshark
      - ngrep
      - telnet
      - mitmproxy
      - socat
      - zmap
      - masscan
      - zgrab