id: afd04601-12fc-4149-9b78-9c3f8fe45d39
logsource:
  product: linux
title: Network Activity Detected via cat
description: >
  This rule monitors for the execution of the cat command, followed by a
  connection attempt by the same process.  Cat is capable of transferring data
  via tcp/udp channels by redirecting its read output to a /dev/tcp or /dev/udp 
  channel. This activity is highly suspicious, and should be investigated.
  Attackers may leverage this capability  to transfer tools or files to another
  host in the network or exfiltrate data while attempting to evade detection  in
  the process.
tags:
  - attack.execution
  - attack.t1059
  - Domain: Endpoint
  - OS: Linux
  - Use Case: Threat Detection
  - Tactic: Command and Control
  - Data Source: Elastic Defend
falsepositives: []
level: medium
status: experimental
references:
  - 'https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet'
  - 'https://www.revshells.com/'
author: hoang.nguyen
detection:
  condition: selection and not network_selection
  selection:
    process.name:
      - cat
    process.parent.name:
      - bash
      - dash
      - sh
      - tcsh
      - csh
      - zsh
      - ksh
      - fish
  network_selection:
    event.action:
      - connection_attempted
      - disconnect_received
    destination.ip|cidr:
      - 10.0.0.0/8
      - 127.0.0.0/8
      - 169.254.0.0/16
      - 172.16.0.0/12
      - 192.0.0.0/24
      - 192.0.0.0/29
      - 192.0.0.8/32
      - 192.0.0.9/32
      - 192.0.0.10/32
      - 192.0.0.170/32
      - 192.0.0.171/32
      - 192.0.2.0/24
      - 192.31.196.0/24
      - 192.52.193.0/24
      - 192.168.0.0/16
      - 192.88.99.0/24
      - 224.0.0.0/4
      - 100.64.0.0/10
      - 192.175.48.0/24
      - 198.18.0.0/15
      - 198.51.100.0/24
      - 203.0.113.0/24
      - 240.0.0.0/4
      - '::1'
      - 'FE80::/10'
      - 'FF00::/8'
