id: V5os7Y8BcCA81s-JUj3x
logsource:
  product: linux
title: Suspicious Network Activity to the Internet
description: >-
  This rule monitors for network connectivity to the internet from a previously
  unknown executable located in a suspicious directory. An alert from this rule
  can indicate the presence of potentially malicious activity, such as the
  execution of unauthorized or suspicious processes attempting to establish
  connections to unknown or suspicious destinations such as a command and
  control server. Detecting and investigating such behavior can help identify
  and mitigate potential security threats, protecting the system and its data
  from potential compromise.
tags:
  - attack.command_and_control
  - attack.t1071
falsepositives:
  - Installation of new software
  - >-
    System administrators or developers using tunneling/forwarding for benign
    purposes
level: low
status: experimental
references:
  - >-
    https://www.elastic.co/guide/en/security/master/invest-guide-run-osquery.html
author: hoang.nguyen
detection:
  condition: selection and not selection1
  selection:
    host.os.type: linux
    event.category: network
    event.action|contains:
      - connection_attempted
      - ipv4_connection_attempt_event
    process.executable|contains:
      - /etc/crontab
      - /etc/rc.local
      - ./*
      - /boot/*
      - /dev/shm/*
      - /etc/cron.*/*
      - /etc/init.d/*
      - /etc/rc*.d/*
      - /etc/update-motd.d/*
      - /home/*/.*
      - /run/*
      - /srv/*
      - /tmp/*
      - /usr/lib/update-notifier/*
      - /var/tmp/*
      - /var/log/*
    source.ip|contains:
      - 10.0.0.0/8
      - 127.0.0.0/8
      - 172.16.0.0/12
      - 192.168.0.0/16
  selection1:
    process.executable|contains:
      - /tmp/newroot/*
      - /tmp/snap.rootfs*
    process.name|contains:
      - apt
      - chrome
      - curl
      - dnf
      - dockerd
      - dpkg
      - firefox-bin
      - java
      - kite-update
      - kited
      - node
      - npm
      - slam12aws
      - wget
      - yum
      - ansible*
      - aws*
      - php*
      - pip*
      - python*
      - steam*
      - terraform*
    destination.ip|contains:
      - 10.0.0.0/8
      - 100.64.0.0/10
      - 127.0.0.0/8
      - 169.254.0.0/16
      - 172.16.0.0/12
      - 192.0.0.0/24
      - 192.0.0.0/29
      - 192.0.0.10/32
      - 192.0.0.170/32
      - 192.0.0.171/32
      - 192.0.0.8/32
      - 192.0.0.9/32
      - 192.0.2.0/24
      - 192.168.0.0/16
      - 192.175.48.0/24
      - 192.31.196.0/24
      - 192.52.193.0/24
      - 192.88.99.0/24
      - 198.18.0.0/15
      - 198.51.100.0/24
      - 203.0.113.0/24
      - 224.0.0.0/4
      - 240.0.0.0/4
      - '::1'
      - 'FE80::/10'
      - 'FF00::/8'
      - 0.0.0.0