id: 6ace94ba-f02c-4d55-9f53-87d99b6f9af4
logsource:
  product: linux
title: Suspicious Utility Launched via ProxyChains
description: >
  This rule monitors for the execution of suspicious linux tools through
  ProxyChains. ProxyChains is a command-line tool that enables the routing of
  network connections through intermediary proxies, enhancing anonymity and
  enabling access to restricted resources. Attackers can exploit the ProxyChains
  utility to hide their true source IP address, evade detection, and perform
  malicious activities through a chain of proxy servers, potentially masking
  their identity and intentions.
tags:
  - attack.execution
  - attack.t1572
falsepositives:
  - New benign software installation activity
  - System administrator or developer using ProxyChains for benign purposes
level: low
status: experimental
references:
  - >-
    https://blog.bitsadmin.com/living-off-the-foreign-land-windows-as-offensive-platform
author: hoang.nguyen
detection:
  condition: selection
  selection:
    process.name:
      - proxychains
    process.args|contains:
      - ssh
      - sshd
      - sshuttle
      - socat
      - iodine
      - iodined
      - dnscat
      - hans
      - hans-ubuntu
      - ptunnel-ng
      - ssf
      - 3proxy
      - ngrok
      - gost
      - pivotnacci
      - chisel*
      - nmap
      - ping
      - python*
      - php*
      - perl
      - ruby
      - lua*
      - openssl
      - nc
      - netcat
      - ncat
      - telnet
      - awk
      - java
      - ftp
      - curl
      - wget
