id: 66c058f3-99f4-4d18-952b-43348f2577a0
logsource:
  product: linux
title: Linux Process Hooking via GDB
description: >-
  This rule monitors for potential memory dumping through gdb. Attackers may
  leverage memory dumping techniques to attempt secret extraction from
  privileged processes. Tools that display this behavior include truffleproc
  andbashmemorydump. This behavior should not happen by default, and should be
  investigated thoroughly.
tags:
  - attack.credential_access
  - attack.t1003.007
falsepositives:
  - System administrators using gdb for legitimate purposes
level: low
status: experimental
references:
  - 'https://github.com/controlplaneio/truffleproc'
  - 'https://github.com/hajzer/bash-memory-dump'
author: hoang.nguyen
detection:
  selection:
    host.os.type: linux
    event.type: start
    event.action|contains:
      - exec
      - exec_event
      - executed
      - process_started
    process.name: gdb
    process.args|contains:
      - '--pid'
      - '-p'
    condition: not process.args == "1"
  condition: selection
