id: e7cb3cfd-aaa3-4d7b-af18-23b89955062c
logsource:
  product: linux
title: Potential Linux Credential Dumping via Unshadow
description: >-
  Identifies the execution of the unshadow utility which is part of John the
  Ripper, a password-cracking tool on the host machine. Malicious actors can use
  the utility to retrieve the combined contents. Using the combined file
  generated from the utility, the malicious threat actors can use them as input
  for password-cracking utilities or prepare themselves for future operations by
  gathering credential information of the victim.
tags:
  - attack.credential_access
  - attack.t1003.008
falsepositives:
  - System administrators using unshadow for legitimate purposes
level: medium
status: experimental
references:
  - 'https://www.cyberciti.biz/faq/unix-linux-password-cracking-john-the-ripper/'
author: hoang.nguyen
detection:
  condition: selection
  selection:
    process.args|contains:
      - unshadow

