id: 835c0622-114e-40b5-a346-f843ea5d01f1
logsource:
  product: linux
title: Potential Linux Local Account Brute Force Detected
description: >-
  Identifies multiple consecutive login attempts executed by one process
  targeting a local linux  user account within a short time interval.
  Adversaries might brute force login attempts across different users with a
  default wordlist or a set of customly crafted passwords in an attempt to gain
  access to these accounts.
tags:
  - attack.credential_access
  - attack.t1110.001
falsepositives:
  - System administrators using 'su' for legitimate purposes
level: medium
status: experimental
references:
  - 'https://attack.mitre.org/techniques/T1110/'
author: hoang.nguyen
detection:
  condition: selection and not selection1
  selection:
    host.os.type:
      - linux
    event.type:
      - start
    event.action:
      - exec
    process.name:
      - su
  selection1:
    process.name|contains:
      - bash
      - dash
      - ash
      - sh
      - tcsh
      - csh
      - zsh
      - ksh
      - fish
      - clickhouse-server
      - ma
      - gitlab-runner
      - updatedb.findutils
      - cron
