id: 5Zqw7Y8BcCA81s-JTIlZ
logsource:
  product: linux
title: Potential External Linux SSH Brute Force Detected
description: >-
  Identifies multiple external consecutive login failures targeting a user
  account from the same source address within a   short time interval.
  Adversaries will often brute force login attempts across multiple users with a
  common or known   password, in an attempt to gain access to these accounts.
tags:
  - attack.credential_access
  - attack.t1110.001
  - attack.t1110.003
falsepositives:
  - '  - Authentication misconfiguration or obsolete credentials '
  - '  - Service account password expired'
  - ' - Infrastructure or availability issue'
level: low
status: test
references: []
author: hoang.nguyen
detection:
  condition: selection and not Selection_2
  selection:
    host.os.type:
      - linux
    event.action:
      - authenticated
    auditd.data.terminal:
      - ssh
    auditd.summary.object.primary:
      - ssh
    event.outcome:
      - failure
  Selection_2:
    source.ip|contains:
      - 10.0.0.0/8
      - 127.0.0.0/8
      - 169.254.0.0/16
      - 172.16.0.0/12
      - 192.0.0.0/24
      - 192.0.0.0/29
      - 192.0.0.8/32
      - 192.0.0.9/32
      - 192.0.0.10/32
      - 192.0.0.170/32
      - 192.0.0.171/32
      - 100.64.0.0/10
      - 192.175.48.0/24
      - 198.18.0.0/15
      - 198.51.100.0/24
      - 203.0.113.0/24
      - 240.0.0.0/4
      - '::1'
      - 'FE80::/10'
      - 'FF00::/8'