id: E5p17Y8BcCA81s-JMGdd
logsource:
  product: linux
title: Linux init Secret Dump via GDB
description: >-
  This rule monitors for the potential memory dump of the init process (PID 1)
  through gdb. Attackers may leverage memory   dumping techniques to attempt
  secret extraction from privileged processes. Tools that display this behavior
  include   truffleproc and bash-memory-dump. This behavior should not happen by
  default, and should be investigated thoroughly.
tags:
  - attack.credential_access
  - attack.t1003.007
falsepositives:
  - System administrators using gdb for legitimate purposes
level: medium
status: experimental
references:
  - 'https://github.com/controlplaneio/truffleproc'
  - 'https://github.com/hajzer/bash-memory-dump'
author: hoang.nguyen
detection:
  selection:
    host.os.type: linux
    event.type: start
    event.action|contains:
      - exec
      - exec_event
    process.name: gdb
    process.args|contains:
      - '--pid'
      - '-p'
    process.args: '1'
  condition: selection