id: QJpL7Y8BcCA81s-JG04b
logsource:
  product: linux
title: Sensitive Files Compression
description: >-
  Identifies the use of a compression utility to collect known files containing
  sensitive information, such as credential sand system configurations.
tags:
  - attack.collection
  - attack.credential_access
  - attack.t1560.001
  - attack.t1552.001
falsepositives:
  - New software installations
  - >-
    System administrators or developers using compression utilities for benign
    purposes
level: medium
status: experimental
references:
  - >-
    https://www.trendmicro.com/en_ca/research/20/l/teamtnt-now-deploying-ddos-capable-irc-bot-tntbotinger.html
author: hoang.nguyen
detection:
  condition: selection
  selection:
    process.name|contains:
      - zip
      - tar
      - gzip
      - hdiutil
      - 7z
    process.args|contains:
      - /root/.ssh/id_rsa
      - /root/.ssh/id_rsa.pub
      - /root/.ssh/id_ed25519
      - /root/.ssh/id_ed25519.pub
      - /root/.ssh/authorized_keys
      - /root/.ssh/authorized_keys2
      - /root/.ssh/known_hosts
      - /root/.bash_history
      - /etc/hosts
      - /home/*/.ssh/id_rsa
      - /home/*/.ssh/id_rsa.pub
      - /home/*/.ssh/id_ed25519
      - /home/*/.ssh/id_ed25519.pub
      - /home/*/.ssh/authorized_keys
      - /home/*/.ssh/authorized_keys2
      - /home/*/.ssh/known_hosts
      - /home/*/.bash_history
      - /root/.aws/credentials
      - /root/.aws/config
      - /home/*/.aws/credentials
      - /home/*/.aws/config
      - /root/.docker/config.json
      - /home/*/.docker/config.json
      - /etc/group
      - /etc/passwd
      - /etc/shadow
      - /etc/gshadow