id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Suspicious Java Children Processes
description: Detects java process spawning suspicious children
tags:
  - attack.execution
  - attack.t1059
level: high
status: experimental
references:
  - 'https://www.tecmint.com/different-types-of-linux-shells/'
author: hoang.nguyen
detection:
  condition: selection
  selection:
    process.executable:
      - /usr/bin/java
    process.args|contains:
      - /bin/sh
      - bash
      - dash
      - ksh
      - zsh
      - csh
      - fish
      - curl
      - wget
      - python
