title: Linux Network Service Scanning
id: 3761e026-f259-44e6-8826-719ed8079408
status: test
description: Detects enumeration of local or remote network services.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1046/T1046.md
author: hoang.nguyen
tags:
    - attack.discovery
    - attack.t1046
logsource:
    product: linux
detection:
    selection:
        process.executable|endswith:
            - '/telnet'
            - '/nmap'
            - '/netcat'
            - '/nc'
            - '/ncat'
            - '/nc.openbsd'
        
        process.args|contains:
            - telnet
            - nmap
            - netcat
            - nc
            - ncat
            - nc.openbsd
    condition: selection
falsepositives:
    - Legitimate administration activities
level: low