id: mheU5o8BMRnKjsTPaTBz
logsource:
  product: linux
title: ProxyChains Activity
description: >
  This rule monitors for the execution of the ProxyChains utility. ProxyChains
  is a command-line tool that enables the routing of network connections through
  intermediary proxies, enhancing anonymity and enabling access to restricted
  resources. Attackers can exploit the ProxyChains utility to hide their true
  source IP address, evade detection, and perform malicious activities through a
  chain of proxy servers, potentially masking their identity and intentions.
tags:
  - attack.execution
  - attack.t1572
falsepositives:
  - New benign software installation activity
  - System administrator or developer using ProxyChains for benign purposes
level: low
status: experimental
references:
  - >-
    https://blog.bitsadmin.com/living-off-the-foreign-land-windows-as-offensive-platform
author: hoang.nguyen
detection:
  selection:
    process.name: proxychains
  condition: selection