id: ''
logsource:
  product: linux
title: Detect Web Shell File Upload
description: Detects the upload of a potential web shell file to a web server
tags:
  - attack.t1505.003
falsepositives:
  - Legitimate web application deployments or updates
level: high
status: experimental
references:
  - 'https://www.elastic.co/guide/en/security/current/web-shell-detection.html'
author: hoang.nguyen
detection:
  condition: selection
  selection:
    file.path|endswith:
      - .php
      - .asp
      - .jsp
      - .aspx
    file.path|contains:
      - /var/www/html
    process.name:
      - apache2
    user.name:
      - www-data
    auditd.paths.nametype|contains:
      - CREATE
