id: ""
logsource:
  product: linux
title: AWS Credentials Searched For Inside A Container
description: >-
  This rule detects the use of system search utilities like grep and find to
  search for AWS credentials inside a container.
tags:
  - attack.Credential_Access
  - attack.TA0006
  - attack.T1552
  - attack.T1552.001
  - attack.auditbeat
falsepositives: []
level: medium
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0006/'
  - 'https://attack.mitre.org/techniques/T1552/'
  - 'https://attack.mitre.org/techniques/T1552/001/'
author: hoang.nguyen
detection:
  condition: Selection_1 and Selection_2 and (Selection_3 or Selection_4) and Selection_5
  Selection_1:
    event.module|contains:
      - cloud_defend
      - executed
  Selection_2:
    event.type|all:
      - start
  Selection_3:
    process.name|contains:
      - grep
      - egrep
      - fgrep
      - find
      - locate
      - mlocate
  Selection_4:
    process.args|contains:
      - grep
      - egrep
      - fgrep
      - find
      - locate
      - mlocate
  Selection_5:
    process.args|contains:
      - '*aws_access_key_id*'
      - '*aws_secret_access_key*'
      - '*aws_session_token*'
      - '*accesskeyid*'
      - '*secretaccesskey*'
      - '*access_key*'
      - '*.aws/credentials*'