id: ""
logsource:
  product: linux
title: Linux init PID 1 Secret Dump via GDB
description: >-
  This rule monitors for the potential memory dump of the init process (PID 1)
  through gdb.
tags:
  - attack.Credential_Access
  - attack.TA0006
  - attack.Credential_Dumping
  - attack.T1003
  - attack.T1003.007
  - attack.auditbeat
falsepositives: []
level: medium
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0006/'
  - 'https://attack.mitre.org/techniques/T1003/'
  - 'https://attack.mitre.org/techniques/T1003/007/'
author: hoang.nguyen
detection:
  condition: >-
    Selection_1 and Selection_2 and Selection_3 and Selection_4 and Selection_5
    and Selection_6
  Selection_1:
    host.os.type|all:
      - linux
  Selection_2:
    event.type|all:
      - start
  Selection_3:
    event.action|contains:
      - exec
      - exec_event
      - executed
  Selection_4:
    process.name|all:
      - gdb
  Selection_5:
    process.args|contains:
      - '--pid'
      - '-p'
  Selection_6:
    process.args|all:
      - '1'