id: ""
logsource:
  product: linux
title: Potential Linux Credential Dumping Proc FileSystem
description: >-
  Identifies the execution of the mimipenguin exploit script which is linux
  adaptation of Windows tool mimikatz.
tags:
  - attack.Credential_Access
  - attack.TA0006
  - attack.T1003
  - attack.T1003.007
  - attack.T1212
falsepositives: []
level: medium
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0006/'
  - 'https://attack.mitre.org/techniques/T1003/'
  - 'https://attack.mitre.org/techniques/T1003/007/'
  - 'https://attack.mitre.org/techniques/T1212/'
author: hoang.nguyen
detection:
  condition: >-
    (Selection_1 and Selection_2 and Selection_3 and Selection_4) or
    (Selection_5 and Selection_6 and Selection_7 and Selection_8)
  Selection_1:
    host.os.type|all:
      - linux
  Selection_2:
    process.name|all:
      - ps
  Selection_3:
    event.action|contains:
      - exec
      - executed
  Selection_4:
    process.args|contains:
      - '-eo'
      - pid
      - command
  Selection_5:
    host.os.type|all:
      - linux
  Selection_6:
    process.name|all:
      - strings
  Selection_7:
    event.action|contains:
      - exec
      - executed
  Selection_8:
    process.args|startswith:
      - /tmp/