id: g3mCQ5ABaOvqpBKnOLIJ
logsource:
  product: linux
title: Potential Linux Credential Dumping via Unshadow
description: >-
  Identifies the execution of the unshadow utility which is part of John the
  Ripper, a password-cracking tool on the host machine.
tags:
  - attack.Credential_Access
  - attack.TA0006
  - attack.T1003
  - attack.T1003.008
falsepositives: []
level: medium
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0006/'
  - 'https://attack.mitre.org/techniques/T1003/'
  - 'https://attack.mitre.org/techniques/T1003/008/'
author: hoang.nguyen
detection:
  condition: Selection_1 and Selection_2 and Selection_3 and Selection_4
  Selection_1:
    host.os.type|all:
      - linux
  Selection_2:
    event.type|all:
      - start
  Selection_3:
    event.action|contains:
      - exec
      - exec_event
      - executed
  Selection_4:
    process.name|all:
      - unshadow