id: ""
logsource:
  product: linux
title: Potential Successful Linux RDP Brute Force Attack
description: >-
  An RDP (Remote Desktop Protocol) brute force attack involves an attacker
  repeatedly attempting various username and password combinations to gain
  unauthorized access to a remote computer via RDP, and if successful, the
  potential impact can include unauthorized control over the compromised system,
  data theft, or the ability to launch further attacks within the network,
  jeopardizing the security and confidentiality of the targeted system and
  potentially compromising the entire network infrastructure.
tags:
  - attack.Credential_Access
  - attack.TA0006
  - attack.Brute_Force
  - attack.T1110
  - attack.T1110.001
  - attack.T1110.003
  - attack.auditbeat
falsepositives: []
level: medium
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0006/'
  - 'https://attack.mitre.org/techniques/T1110/'
  - 'https://attack.mitre.org/techniques/T1110/001/'
  - 'https://attack.mitre.org/techniques/T1110/003/'
author: hoang.nguyen
detection:
  condition: >-
    (Selection_1 and Selection_2 and Selection_3 and Selection_4) or
    (Selection_1 and Selection_2 and Selection_3 and Selection_5)
  Selection_1:
    host.os.type|all:
      - linux
  Selection_2:
    event.action|contains:
      - authenticated
      - authentication
      - authenticate
  Selection_3:
    auditd.data.terminal|contains:
      - rdp
  Selection_4:
    event.outcome|all:
      - failure
  Selection_5:
    event.outcome|all:
      - success