id: ""
logsource:
  product: linux
title: Potential Unauthorized Access Wildcard Injection
description: >-
  This rule monitors for the execution of the chown and chmod commands with
  command line flags that could indicate a wildcard injection attack.
tags:
  - attack.Privilege_Escalation
  - attack.TA0004
  - attack.T1068
  - attack.Credential_Access
  - attack.TA0006
  - attack.T1003
  - attack.T1003.008
  - attack.auditbeat
falsepositives: []
level: low
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0004/'
  - 'https://attack.mitre.org/techniques/T1068/'
  - 'https://attack.mitre.org/tactics/TA0006/'
  - 'https://attack.mitre.org/techniques/T1003/'
  - 'https://attack.mitre.org/techniques/T1003/008/'
author: hoang.nguyen
detection:
  condition: >-
    Selection_1 and Selection_2 and Selection_3 and Selection_4 and Selection_5
    and Selection_6
  Selection_1:
    host.os.type|all:
      - linux
  Selection_2:
    event.type|all:
      - start
  Selection_3:
    event.action|contains:
      - exec
      - exec_event
      - executed
      - process_started
  Selection_4:
    process.name|contains:
      - chown
      - chmod
  Selection_5:
    process.args|all:
      - '-R'
  Selection_6:
    process.args|startswith:
      - '--reference='