id: ""
logsource:
  product: linux
title: Sensitive Keys Or Passwords Searched In Container
description: >-
  This rule detects the use of system search utilities like grep and find to
  search for private SSH keys or passwords inside a container.
tags:
  - attack.Credential_Access
  - attack.TA0006
  - attack.T1552
  - attack.T1552.001
falsepositives: []
level: medium
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0006/'
  - 'https://attack.mitre.org/techniques/T1552/'
  - 'https://attack.mitre.org/techniques/T1552/001/'
author: hoang.nguyen
detection:
  condition: >-
    Selection_1 and Selection_2 and (((Selection_3 or Selection_4) and
    Selection_5) or ((Selection_6 or Selection_7) and Selection_8))
  Selection_1:
    container.id|all:
      - '*'
  Selection_2:
    event.type|all:
      - start
  Selection_3:
    process.name|contains:
      - grep
      - egrep
      - fgrep
  Selection_4:
    process.args|contains:
      - grep
      - egrep
      - fgrep
  Selection_5:
    process.args|contains:
      - '*BEGIN PRIVATE*'
      - '*BEGIN OPENSSH PRIVATE*'
      - '*BEGIN RSA PRIVATE*'
      - '*BEGIN DSA PRIVATE*'
      - '*BEGIN EC PRIVATE*'
      - '*pass*'
      - '*ssh*'
      - '*user*'
  Selection_6:
    process.name|contains:
      - find
      - locate
      - mlocate
  Selection_7:
    process.args|contains:
      - find
      - locate
      - mlocate
  Selection_8:
    process.args|contains:
      - '*id_rsa*'
      - '*id_dsa*'