title: Modification of ld.so.preload
status: experimental
description: Identifies modification of ld.so.preload for shared object injection. This technique is used by attackers to load arbitrary code into processes.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1574.006/T1574.006.md
    - https://eqllib.readthedocs.io/en/latest/analytics/fd9b987a-1101-4ed3-bda6-a70300eaf57e.html
author: hoang.nguyen
tags:
    - attack.defense-evasion
    - attack.t1574.006
logsource:
    product: linux
detection:
    selection:
        process.executable: '/etc/ld.so.preload'
    condition: selection
falsepositives:
    - Unknown
level: high