title: Privileged User Has Been Created
id: 0ac15ec3-d24f-4246-aa2a-3077bb1cf90e
status: experimental
description: Detects the addition of a new user to a privileged group such as "root" or "sudo"
references:
    - https://digital.nhs.uk/cyber-alerts/2018/cc-2825
    - https://linux.die.net/man/8/useradd
    - https://github.com/redcanaryco/atomic-red-team/blob/25acadc0b43a07125a8a5b599b28bbc1a91ffb06/atomics/T1136.001/T1136.001.md#atomic-test-5---create-a-new-user-in-linux-with-root-uid-and-gid
author: hoang.nguyen
tags:
    - attack.persistence
    - attack.t1136.001
    - attack.t1098
logsource:
    product: linux
detection:
    selection_1:
        process.executable|endswith:
            - '/usermod/
        process.args|contains:
            - '-aG'
    selection_2:
        process.args|contains:
            - root
            - sudo
    condition: all of selection_*
falsepositives:
    - Administrative activity
level: high