title: rc File Creation
status: experimental
description: Detect the creation/alteration of the rc.local/rc.common file. The /etc/rc.local file is used to start custom applications, services, scripts or commands during start-up.
references:
    - https://www.intezer.com/blog/malware-analysis/hiddenwasp-malware-targeting-linux-systems/
    - https://pberba.github.io/security/2022/02/06/linux-threat-hunting-for-persistence-initialization-scripts-and-shell-configuration/#8-boot-or-logon-initialization-scripts-rc-scripts
    - https://www.cyberciti.biz/faq/how-to-enable-rc-local-shell-script-on-systemd-while-booting-linux-system/
    - https://www.elastic.co/security-labs/sequel-on-persistence-mechanisms
author: hoang.nguyen
tags:
    - attack.persistence
    - attack.t1037
    - attack.t1037.004
logsource:
    product: linux
detection:
    selection:
        event.action|contains:
            - rename
            - renamed
            - create
            - creation
            - created
        file.path|contains:
            - '/etc/rc.local'
            - '/etc/rc.common'
    filter:
        process.executable|contains:
            - '/bin/dpkg'
            - '/usr/bin/dpkg'
            - '/bin/dockerd'
            - '/usr/bin/dockerd'
            - '/usr/sbin/dockerd'
            - '/bin/microdnf'
            - '/usr/bin/microdnf'
            - '/bin/rpm'
            - '/usr/bin/rpm'
            - '/bin/snapd'
            - '/usr/bin/snapd'
            - '/bin/yum'
            - '/usr/bin/yum'    
            - '/bin/dnf'
            - '/usr/bin/dnf'
            - '/bin/podman'
            - '/usr/bin/podman'
            - '/bin/dnf-automatic'
            - '/usr/bin/dnf-automatic'
            - '/bin/pacman'
            - '/usr/bin/pacman'
            - '/usr/bin/dpkg-divert'
            - '/bin/dpkg-divert'
            - '/sbin/apk'
            - '/usr/sbin/apk'
            - '/usr/local/sbin/apk'
            - '/usr/bin/apt'
            - '/usr/sbin/pacman'
            - '/usr/bin/puppet'
            - '/bin/puppet'
            - '/opt/puppetlabs/puppet/bin/puppet'
            - '/usr/bin/chef-client'
            - '/bin/chef-client'
            - '/bin/autossl_check'
            - '/usr/bin/autossl_check'
            - '/proc/self/exe'
            - '/dev/fd/*'
            - '/usr/bin/pamac-daemon'
            - '/bin/pamac-daemon'
            - '/usr/lib/snapd/snapd'
            - '/usr/local/bin/dockerd'
            - '/usr/libexec/platform-python'

    condition: selection and not filter
falsepositives:
    - Unknown
level: high