title: Remote Access Tool - Team Viewer Session Started On Linux Host
status: experimental
description: |
    Detects the command line executed when TeamViewer starts a session started by a remote host.
    Once a connection has been started, an investigator can verify the connection details by viewing the "incoming_connections.txt" log file in the TeamViewer folder.
author: hoang.nguyen
tags:
    - attack.initial-access
    - attack.t1133
logsource:
    category: process_creation
    product: linux
detection:
    selection1:
        process.executable|endswith: '/TeamViewer_Service'
    selection2:
        process.executable|endswith: '/TeamViewer_Desktop'
        process.args|endswith: '/TeamViewer_Desktop --IPCport 5939 --Module 1'
    condition: selection1 or selection2
falsepositives:
    - Legitimate usage of TeamViewer
level: low