id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Mount Launched Inside a Privileged Container
description: >-
  This rule detects the use of the mount utility from inside a privileged
  container. The mount command is used to make a device or file system
  accessible to the system, and then to connect its root directory to a
  specified mount point on the local file system. When launched inside a
  privileged container--a container deployed with all the capabilities of the
  host machine-- an attacker can access sensitive host level files which could
  be used for further privilege escalation and container escapes to the host
  machine. Any usage of mount inside a running privileged container should be
  further investigated.
tags:
  - attack.privilege_escalation
  - attack.TA0004
  - attack.t1611
falsepositives: []
level: low
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: Selection_1
  Selection_1:
    event.module|contains:
      - cloud_defend
    event.type|all:
      - start
    process.name|all:
      - mount
    process.args|all:
      - mount
