id: ""
logsource:
  product: linux
title: Potential Container Escape Mod release_agent File
description: >-
  This rule detects modification of the CGroup release_agent file from inside a
  privileged container. The release_agent is a script that is executed at the
  termination of any process on that CGroup and is invoked from the host.
tags:
  - attack.Privilege_Escalation
  - attack.TA0004
  - attack.T1611
falsepositives: []
level: medium
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0004/'
  - 'https://attack.mitre.org/techniques/T1611/'
author: hoang.nguyen
detection:
  condition: Selection_1 and Selection_2 and Selection_3 and Selection_4
  Selection_1:
    event.module|all:
      - cloud_defend
  Selection_2:
    event.action|all:
      - open
      - opened-file
      - opened
  Selection_3:
    event.type|contains:
      - change
  Selection_4:
    file.name|all:
      - release_agent