id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Potential PriEs via Linux DAC permissions
description: >-
  Identifies potential privilege escalation exploitation of DAC (Discretionary
  access control) file permissions. The rule identifies exploitation of DAC
  checks on sensitive file paths via suspicious processes whose capabilities
  include CAP_DAC_OVERRIDE (where a process can bypass all read write and
  execution checks) or CAP_DAC_READ_SEARCH (where a process can read any file or
  perform any executable permission on the directories).
tags:
  - attack.privilege_escalation
  - attack.TA0004
  - attack.t1068
falsepositives: []
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: Selection_1 and not filter and (filter1 or filter2)
  Selection_1:
    event.category|all:
      - process
    host.os.type|all:
      - linux
    event.type|all:
      - start
    event.action|contains:
      - exec
      - executed
    process.args|contains:
      - '*sudoers*'
      - '*passwd*'
      - '*shadow*'
      - '*/root/*'
  filter:
    user.id|all:
      - '0'
  filter1:
    process.thread.capabilities.permitted|contains:
      - CAP_DAC_*
  filter2:
    process.thread.capabilities.effective|contains:
      - CAP_DAC_*
