id: ""
logsource:
  product: linux
title: Sudoers File Modification
description: >-
  A sudoers file specifies the commands that users or groups can run and from
  which terminals. Adversaries can take advantage of these configurations to
  execute commands as other users or spawn processes with higher privileges.
tags:
  - attack.Privilege_Escalation
  - attack.TA0004
  - attack.T1548
  - attack.T1548.003
  - attack.auditbeat
falsepositives: []
level: medium
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0004/'
  - 'https://attack.mitre.org/techniques/T1548/'
  - 'https://attack.mitre.org/techniques/T1548/003/'
author: Elastic
detection:
  condition: >-
    Selection_1 and Selection_2 and Selection_3 and not Selection_4 and not
    Selection_5
  Selection_1:
    event.category|all:
      - file
  Selection_2:
    event.type|all:
      - change
  Selection_3:
    file.path|startswith:
      - /etc/sudoers
      - /private/etc/sudoers
  Selection_4:
    process.name|contains:
      - dpkg
      - platform-python
      - puppet
      - yum
      - dnf
  Selection_5:
    process.executable|contains:
      - /opt/chef/embedded/bin/ruby
      - /opt/puppetlabs/puppet/bin/ruby
      - /usr/bin/dockerd