id: ""
logsource:
  product: linux
title: Potential Protocol Tunneling via Chisel Server
description: >-
  This rule monitors for common command line flags leveraged by the Chisel
  server utility followed by a received connection within a timespan of 1
  minute.
tags:
  - attack.Command_and_Control
  - attack.TA0011
  - attack.T1572
  - attack.auditbeat
falsepositives:
  - >-
    If this activity is related to new benign software installation activity,
    consider adding exceptions — preferably with a combination of user and
    command line conditions. 
  - >-
    If this activity is related to a system administrator or developer who uses
    port tunneling for benign purposes, consider adding exceptions for specific
    user accounts or hosts. 
  - >-
    Try to understand the context of the execution by thinking about the user,
    machine, or business purpose. A small number of endpoints, such as servers
    with unique software, might appear unusual but satisfy a specific business
    need.
level: medium
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0011/'
  - 'https://attack.mitre.org/techniques/T1572/'
author: hoang.nguyen
detection:
  condition: >-
    (Selection_1 and Selection_2 and Selection_3 and Selection_4 and
    Selection_5) or (Selection_1 and Selection_2 and Selection_8 and not
    (Selection_9 or Selection_10))
  Selection_1:
    host.os.type|all:
      - linux
  Selection_2:
    event.type|contains:
      - start
  Selection_3:
    event.action|contains:
      - exec
      - executed
  Selection_4:
    process.args|contains:
      - server
  Selection_5:
    process.args|contains:
      - '--port'
      - '-p'
      - '--reverse'
      - '--backend'
      - '--socks5'
  Selection_8:
    event.action|contains:
      - connection_accepted
      - connected-to
  Selection_9:
    destination.ip|contains:
      - 'null'
      - 127.0.0.1
      - '::1'
  Selection_10:
    process.name|contains:
      - python*
      - php*
      - perl
      - ruby
      - lua*
      - openssl
      - nc
      - netcat
      - ncat
      - telnet
      - awk
      - java
      - telnet
      - ftp
      - socat
      - curl
      - wget
      - dpkg
      - docker
      - dockerd
      - yum
      - apt
      - rpm
      - dnf
      - ssh
      - sshd
      - hugo