title: Suspicious Curl File Upload - Linux
status: experimental
description: Detects a suspicious curl process start the adds a file to a web request
references:
    - https://medium.com/@petehouston/upload-files-with-curl-93064dcccc76
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1105/T1105.md#atomic-test-19---curl-upload-file
    - https://curl.se/docs/manpage.html
author: hoang.nguyen
tags:
    - attack.exfiltration
    - attack.t1567
    - attack.t1105
logsource:
    product: linux
detection:
    selection_img:
        process.executable|endswith: '/curl'
    selection_cli:
        - process.args|contains:
              - ' --form' # Also covers the "--form-string"
              - ' --upload-file '
              - ' --data '
              - ' --data-' # For flags like: "--data-ascii", "--data-binary", "--data-raw", "--data-urlencode"
    filter_optional_localhost:
        process.args|contains:
            - '://localhost'
            - '://127.0.0.1'
    condition: all of selection_* and not 1 of filter_optional_*
falsepositives:
    - Scripts created by developers and admins
level: medium