id: ""
logsource:
  product: linux
title: Suspicious Network Connection via systemd
description: >-
  Detects suspicious network events executed by systemd, potentially indicating
  persistence through a systemd backdoor.
tags:
  - attack.Persistence
  - attack.TA0003
  - attack.T1543
  - attack.T1543.002
  - attack.T1574
  - attack.Command_and_Control
  - attack.TA0011
  - attack.Defense_Evasion
  - attack.TA0005
  - attack.auditbeat
falsepositives: []
level: medium
status: experimental
references:
  - 'https://attack.mitre.org/tactics/TA0003/'
  - 'https://attack.mitre.org/techniques/T1543/'
  - 'https://attack.mitre.org/techniques/T1543/002/'
  - 'https://attack.mitre.org/techniques/T1574/'
  - 'https://attack.mitre.org/tactics/TA0011/'
  - 'https://attack.mitre.org/tactics/TA0005/'
author: hoang.nguyen
detection:
  condition: Selection_1
  Selection_1:
    host.os.type|all:
      - linux
    event.type|all:
      - start
    event.action|contains:
      - exec
      - executed
      - connected-to
    process.name|contains:
      - python
      - php
      - perl
      - ruby
      - lua
      - openssl
      - nc
      - netcat
      - ncat
      - telnet
      - awk
