title: Evil-WinRm Execution - PowerShell Module
id: 9fe55ea2-4cd6-4491-8a54-dd6871651b51
status: experimental
description: |
    Detects the execution of Evil-WinRM via PowerShell Module logs by leveraging the hardcoded strings inside the utility.
references:
    - https://github.com/Hackplayers/evil-winrm/blob/7514b055d67ec19836e95c05bd63e7cc47c4c2aa/evil-winrm.rb
    - https://github.com/search?q=repo%3AHackplayers%2Fevil-winrm++shell.run%28&type=code
author: hoang.nguyen
tags:
    - attack.lateral-movement
logsource:
    product: windows
detection:
    selection:
        winlog.event_data.ParentProcessName|endswith:
            - 'wsmprovhost.exe'
    condition: selection
falsepositives:
    - Unknown
level: high