title: Suspicious Encoded PowerShell Command Line
status: experimental
description: Detects suspicious powershell process starts with base64 encoded commands
author: hoang.nguyen
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_1:
        winlog.event_data.ScriptBlockText|contains:
        - FromBase64String
        - ToBase64String
        - ' -EncodedCommand '
        - ' -e '
        - ' -enc '
    selection_2: 
        winlog.event_data.CommandLine|contains:
        - FromBase64String
        - ToBase64String
        - ' -EncodedCommand '
        - ' -e '
        - ' -enc '    
    condition: selection_1 or selection_2
level: high