title: Suspicious Windows Discovery Commands
status: experimental
description: Detects common Windows discovery commands used for system/network enumeration.
author: hoang.nguyen
references:
  - https://attack.mitre.org/techniques/T1018/
  - https://attack.mitre.org/techniques/T1082/
tags:
  - attack.discovery
  - attack.t1018
  - attack.t1082
logsource:
  product: windows
detection:
  selection:
    winlog.event_data.CommandLine|contains:
      - 'systeminfo'
      - 'net view'
      - 'net group /domain'
      - 'net localgroup administrators'
      - 'whoami /all'
      - 'nltest /domain_trusts'
      - 'arp'
      - 'ipconfig'
      - 'netstat'
      - 'tasklist /svc'
      - 'qwinsta'
      - 'query user'
      - 'dsquery'
  condition: selection
falsepositives:
  - Legitimate admin scripts
  - Network troubleshooting
level: medium