title: System Firewall Modification
status: experimental
description: Adversaries may modify system firewalls in order to bypass controls limiting network usage
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.004/T1562.004.md#atomic-test-3---allow-smb-and-rdp-on-microsoft-defender-firewall
    - https://learn.microsoft.com/en-us/troubleshoot/windows-server/networking/netsh-advfirewall-firewall-control-firewall-behavior
author: hoang.nguyen
tags:
    - attack.defense-evasion
    - attack.t1562.004
logsource:
    product: windows
detection:
    selection_img:
        winlog.event_data.Image|endswith: '\netsh.exe'
        winlog.event_data.OriginalFileName: 'netsh.exe'
    selection_cli:
        winlog.event_data.CommandLine|contains|all:
            - 'advfirewall'
            - 'firewall'
            - 'set'
            - 'rule'
            - 'group='
            - 'new'
            - 'enable=Yes'
    condition: all of selection_*
falsepositives:
    - Legitimate administration activity
level: medium