id: ''
logsource:
  product: linux
title: Attempt to Clear Kernel Ring Buffer
description: >-
  Monitors for the deletion of the kernel ring buffer events through dmesg.
  Attackers may clear kernel ring buffer events to evade detection after
  installing a Linux kernel module (LKM).
tags:
  - attack.defense_evasion
  - attack.t1070
  - attack.t1562
  - attack.TA0005
falsepositives:
  - Legitimate administrative actions to clear the kernel ring buffer
level: low
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: selection
  selection:
    host.os.type:
      - linux
    event.type:
      - start
    event.action|contains:
      - exec
      - exec_event
      - executed
      - process_started
    process.name:
      - dmesg
    process.args:
      - '-c'
