id: ''
logsource:
  product: linux
title: Attempt to Disable Syslog Service
description: >-
  Adversaries may attempt to disable the syslog service in an attempt to disrupt
  event logging and evade detection by security controls.
tags:
  - attack.defense_evasion
  - attack.t1562
  - attack.TA0005
falsepositives:
  - >-
    Legitimate administrative actions to stop or disable syslog services for
    maintenance or troubleshooting
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: selection
  selection:
    host.os.type:
      - linux
    event.action|contains:
      - exec
      - exec_event
      - executed
    process.name|contains:
      - service
      - chkconfig
      - systemctl
    process.args|contains:
      - syslog
      - rsyslog
      - syslog-ng
