id: ''
logsource:
  product: linux
title: ESXI Timestomping using Touch Command
description: >-
  Identifies instances where the touch command is executed on a Linux system
  with the  flag, which is used to modify the timestamp of a file based on
  another files timestamp. The rule targets specific VM related paths. These
  paths are associated with VMware virtualization software, and their presence
  in the touch command arguments may indicate that a threat actor is attempting
  to tamper with timestamps of VM-related files and configurations on the
  system.
tags:
  - attack.defense_evasion
  - attack.t1070
  - attack.TA0005
falsepositives:
  - Legitimate administrative actions to modify timestamps of VM-related files
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: selection
  selection:
    host.os.type:
      - linux
    event.type:
      - start
    event.action|contains:
      - exec
      - exec_event
      - executed
      - process_started
    process.name:
      - touch
    process.args|contains:
      - /etc/vmware/*
      - /usr/lib/vmware/*
      - /vmfs/*
      - 'r'
