id: ''
logsource:
  product: linux
title: File made Immutable by Chattr
description: >-
  Detects a file being made immutable using the chattr binary. Making a file
  immutable means it cannot be deleted or renamed, no link can be created to
  this file, most of the files metadata can not be modified, and the file can
  not be opened in write mode. Threat actors will commonly utilize this to
  prevent tampering or modification of their malicious files or any system files
  they have modified for purposes of persistence 
tags:
  - attack.defense_evasion
  - attack.t1222
  - attack.TA0005
falsepositives:
  - Legitimate administrative actions to protect critical files
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: selection and not Selection_2
  selection:
    host.os.type:
      - linux
    event.type:
      - start
    user.id:
      - '0'
    process.executable:
      - /usr/bin/chattr
    process.args|contains:
      - '-*i*'
      - +*i*

  Selection_2:
    process.executable|contains:
      - /lib/systemd/systemd
      - /usr/local/uems_agent/bin/*
      - /usr/lib/systemd/systemd
    process.name|contains:
      - systemd
      - cf-agent
      - ntpdate
      - xargs
      - px
      - preinst
      - auth
