id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Kernel Driver Load by non-root User
description: >-
  Detects the loading of a Linux kernel module by a non-root user through system
  calls. Threat actors may leverage Linux kernel modules to load a rootkit on a
  system providing them with complete control and the ability to hide from
  security products. As other rules monitor for the addition of Linux kernel
  modules through system utilities or .ko files, this rule covers the gap that
  evasive rootkits leverage by monitoring for kernel module additions on the
  lowest level through auditd_manager.
tags:
  - attack.defense_evasion
  - attack.persistence
  - attack.t1547
  - attack.t1014
falsepositives:
  - Legitimate kernel module management operations by system administrators.
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: Selection_1 and not Selection_2
  Selection_1:
    auditd.data.syscall|contains:
      - init_module
      - finit_module
  Selection_2:
    user.id|all:
      - '0'
