id: ''
logsource:
  product: linux
title: Kernel Module Removal
description: >-
  Kernel modules are pieces of code that can be loaded and unloaded into the
  kernel upon demand. They extend the functionality of the kernel without the
  need to reboot the system. This rule identifies attempts to remove a kernel
  module.
tags:
  - attack.defense_evasion
  - attack.t1562
  - attack.TA0005
  - attack.TA0003
  - attack.t1547
falsepositives:
  - >-
    There is usually no reason to remove modules, but some buggy modules require
    it. These can be exempted by username. Note that some Linux distributions
    are not built to support the removal of modules at all.
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: selection and not Selection_2
  selection:
    host.os.type:
      - linux
    event.type:
      - start
    event.action|contains:
      - exec
      - exec_event
      - executed
    process.name|contains:
      - rmmod
      - modprobe
    process.args|contains:
      - '--remove'
      - '-r'
  Selection_2:
    process.name|contains:
      - sudo
      - bash
      - dash
      - ash
      - sh
      - tcsh
      - csh
      - zsh
      - ksh
      - fish
