id: ''
logsource:
  product: linux
title: Potential Hidden Process via Mount Hidepid
description: >-
  Identifies the execution of mount process with hidepid parameter, which can
  make processes invisible to other users from the system. Adversaries using
  Linux kernel can hide the process from other users. When hidepid equals to 2
  option is executed to mount the /proc filesystem, only the root user can see
  all processes and the logged-in user can only see their own process. This
  provides a defense evasion mechanism for the adversaries to hide their process
  executions from all other commands such as ps, top, pgrep and more. With the
  Linux kernel hardening hidepid option all the user has to do is remount the
  /proc filesystem with the option, which can now be monitored and detected.
tags:
  - attack.defense_evasion
  - attack.t1564
  - attack.TA0005
falsepositives:
  - Legitimate administrative actions to enhance system security and privacy.
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: selection
  selection:
    host.os.type:
      - linux
    event.type:
      - start
    event.action|contains:
      - exec
      - exec_event
      - executed
      - process_started
    process.name:
      - mount
    process.args|all:
      - /proc
      - '-o'
      - '.*hidepid=2.*'
