id: ''
logsource:
  product: linux
title: Potential Defense Evasion via PRoot
description: >-
  Identifies the execution of the PRoot utility, an open-source tool for
  user-space implementation of chroot, mount --bind, and binfmt_misc.
  Adversaries can leverage PRoot to expand the scope of their operations to
  multiple Linux distributions and simplify their necessary efforts. PRoot
  provides an attacker with a consistent operational environment across
  different Linux distributions and allows for the execution of malware built on
  other architectures. This technique, known as bring your own filesystem
  (BYOF), can be used to execute malicious payloads, elevate privileges, perform
  network scans, or orchestrate other attacks. While PRoot was not originally
  developed with malicious intent, it can be easily misused for such purposes.
tags:
  - attack.defense_evasion
  - attack.t1211
  - attack.TA0005
falsepositives:
  - Legitimate use of PRoot for testing or development purposes.
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: selection
  selection:
    host.os.type:
      - linux
    event.type:
      - start
    event.action|contains:
      - exec
      - exec_event
      - executed
    process.name:
      - proot
