id: ''
logsource:
  product: linux
title: Potential Disabling of SELinux
description: >-
  Identifies potential attempts to disable Security-Enhanced Linux (SELinux),
  which is a Linux kernel security feature to support access control policies.
  Adversaries may disable security tools to avoid possible detection of their
  tools and activities.
tags:
  - attack.defense_evasion
  - attack.t1562
  - attack.TA0005
falsepositives:
  - >-
    Legitimate administrative actions to disable SELinux for maintenance or
    troubleshooting
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: selection
  selection:
    host.os.type:
      - linux
    event.type:
      - start
    event.action|contains:
      - exec
      - exec_event
      - executed
      - process_started
    process.name:
      - setenforce
    process.args:
      - '0'
