id: ''
logsource:
  product: linux
title: Potential Disabling of AppArmor
description: >-
  This rule monitors for potential attempts to disable AppArmor. AppArmor is a
  Linux security module that enforces fine-grained access control policies to
  restrict the actions and resources that specific applications and processes
  can access. Adversaries may disable security tools to avoid possible detection
  of their tools and activities.
tags:
  - attack.defense_evasion
  - attack.t1562
  - attack.TA0005
falsepositives:
  - >-
    Legitimate administrative actions to disable AppArmor for maintenance or
    troubleshooting
level: low
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: selection
  selection:
    host.os.type:
      - linux
    event.type:
      - start
    event.action|contains:
      - exec
      - exec_event
      - executed
      - process_started
    process.name|contains:
      - systemctl
      - ln
    process.args|contains:
      - disable
      - apparmor
      - /etc/apparmor.d/*
      - /etc/apparmor.d/disable/
