id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Suspicious Kworker UID Elevation
description: >-
  Monitors for the elevation of regular user permissions to root permissions
  through the kworker process. kworker, or kernel worker, processes are part of
  the kernels workqueue mechanism. They are responsible for executing work that
  has been scheduled to be done in kernel space, which might include tasks like
  handling interrupts, background activities, and other kernel-related tasks.
  Attackers may attempt to evade detection by masquerading as a kernel worker
  process, and hijack the execution flow by hooking certain functions or syscalls
  through a rootkit in order to provide easy access to root via a special
  modified command.
tags:
  - attack.persistence
  - attack.defense_evasion
  - attack.t1547
  - attack.t1014
falsepositives: []
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: Selection_1
  Selection_1:
    host.os.type|all:
      - linux
    process.name|all:
      - 'kworker*''
    user.id|all:
      - '0'
