id: d8f8e9b0-5c4f-4a88-9d8f-e8e8e9b05c4f
logsource:
  product: linux
title: Tampering of Shell Command-Line History
description: >-
  Adversaries may attempt to clear or disable the Bash command-line history in
  an attempt to evade detection or forensic investigations.
tags:
  - attack.defense_evasion
  - attack.t1070
  - attack.TA0005
falsepositives:
  - >-
    Legitimate administrative actions to clear command history for privacy
    reasons
level: medium
status: experimental
references:
  - 'https://example.com/reference-to-rule'
author: hoang.nguyen
detection:
  condition: selection
  selection:
    event.action:
      - exec
      - exec_event
      - executed
      - process_started
    event.type: start
    process.args|contains:
      - rm
      - echo
      - ln -sf /dev/null
      - truncate -s0
      - .bash_history
      - /root/.bash_history
      - /home/*/.bash_history
      - /Users/.bash_history
      - /Users/*/.bash_history
      - .zsh_history
      - /root/.zsh_history
      - /home/*/.zsh_history
      - /Users/.zsh_history
      - /Users/*/.zsh_history
    process.name:
      - history
    process.args:
      - '-c'
      - export HISTFILE=/dev/null
      - HISTFILESIZE=0
      - unset HISTFILE
      - set history +o
