id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: BPF Filter Applied Using TC
description: >-
  Detects when the tc (transmission control) binary is utilized to set a BPF
  (Berkeley Packet Filter) on a network interface. Tc is used to configure
  Traffic Control in the Linux kernel. It can shape, schedule, police and drop
  traffic. A threat actor can utilize tc to set a bpf filter on an interface for
  the purpose of manipulating the incoming traffic. This technique is not at all
  common and should indicate abnormal, suspicious or malicious activity.
tags:
  - attack.execution
  - attack.TA0002
  - attack.T1059
  - attack.t1059.004
falsepositives: []
level: high
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: selection and not filter
  selection:
    host.os.type:
      - linux
    process.executable:
      - /usr/sbin/tc
    process.args|contains:
      - filter
      - add
      - bpf
  filter:
    process.executable:
      - /usr/sbin/libvirtd  
