id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Container Management Utility Run In Container
description: >-
  This rule detects when a container management binary is run from inside a
  container. These binaries are critical components of many containerized
  environments, and their presence and execution in unauthorized containers
  could indicate compromise or a misconfiguration.
tags:
  - attack.execution
  - attack.TA0002
  - attack.T1609
falsepositives:
  - >-
    There is a potential for false positives if the container is used for
    legitimate administrative tasks that require the use of container management
    utilities, such as deploying, scaling, or updating containerized
    applications. It is important to investigate any alerts generated by this
    rule to determine if they are indicative of malicious activity or part of
    legitimate container activity.
level: low
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: Selection
  Selection:
    event.type|contains:
      - start
    process.name|contains:
      - dockerd
      - docker
      - kubelet
      - kube-proxy
      - kubectl
      - containerd
      - runc
      - systemd
      - crictl
