id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: EggShell Backdoor Execution
description: >-
  Identifies the execution of and EggShell Backdoor. EggShell is a known post
  exploitation tool for macOS and Linux. 
tags:
  - attack.execution
  - attack.TA0002
  - attack.t1059
  - attack.t1059.006
  - attack.auditbeat
falsepositives: []
level: high
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: Selection_1
  Selection_1:
    event.category|contains:
      - process
    event.type|contains:
      - process_started
      - start
    process.name|contains:
      - espl
    process.ages|contains:
      - eyJkZWJ1ZyI6*
