id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Interactive Terminal Spawned via Perl
description: >-
  Identifies when a terminal (tty) is spawned via Perl. Attackers may upgrade a
  simple reverse shell to a fully interactive tty after obtaining initial access
  to a host.
tags:
  - attack.auditbeat
  - attack.execution
  - attack.TA0002
  - attack.T1059
falsepositives:
  - >-
    There is a potential for false positives if Perl scripts that spawn
    interactive terminals are used for legitimate purposes such as maintenance,
    troubleshooting, or development activities. It is important to investigate
    any alerts generated by this rule to determine if they are indicative of
    malicious activity or part of legitimate system activity.
level: high
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: selection
  selection:
    event.category: process
    host.os.type: linux
    event.type|contains:
      - start
      - process_started
    process.name|contains: perl
    process.args|contains:
      - 'exec "/bin/sh";'
      - 'exec "/bin/dash";'
      - 'exec "/bin/bash";'