id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Netcat Listener Established Inside A Container
description: >-
  This rule detects an established netcat listener running inside a container.
  Netcat is a utility used for reading and writing data across network
  connections, and it can be used for malicious purposes such as establishing a
  backdoor for persistence or exfiltrating data.
tags:
  - attack.execution
  - attack.TA0002
  - attack.T1059
  - attack.T1059.004
falsepositives:
  - >-
    There is a potential for false positives if the container is used for
    legitimate tasks that require the use of netcat, such as network
    troubleshooting, testing or system monitoring. It is important to
    investigate any alerts generated by this rule to determine if they are
    indicative of malicious activity or part of legitimate container activity.
level: high
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: selection1 and ( selection2 or selection3 ) and selection4
  selection1:
    event.type|contains:
      - start
    event.action|contains:
      - fork
      - exec
      - executed
  selection2:
    process.name|contains:
      - nc
      - ncat
      - netcat
      - netcat.openbsd
      - netcat.traditional
  selection3:
    process.args|contains:
      - nc
      - ncat
      - netcat
      - netcat.openbsd
      - netcat.traditional
  selection4:
    process.args|contains:
      - '-*l*'
      - '--listen'
      - '-*p*'
      - '--source-port'
      - '-c'
      - '--sh-exec'
      - '-e'
      - '--exec'
      - echo
      - $*
