id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Network Connection from Binary with RWX
description: >-
  Monitors for the execution of a unix binary with read, write and execute
  memory region permissions, followed by a network connection. The mprotect()
  system call is used to change the access protections on a region of memory
  that has already been allocated. This syscall allows a process to modify the
  permissions of pages in its virtual address space, enabling or disabling
  permissions such as read, write, and execute for those pages. RWX permissions
  on memory is in many cases overly permissive, and should (especially in
  conjunction with an outbound network connection) be analyzed thoroughly.
tags:
  - attack.execution
  - attack.TA0002
  - attack.T1059
  - attack.T1071
  - attack.TA0011
  - attack.t1059.004
  - attack.auditbeat
falsepositives:
  - >-
    There is a potential for false positives if the memory region is allocated
    and the network connection is established for legitimate purposes, such as
    specific applications requiring RWX memory regions for dynamic code
    execution and network communication. It is important to investigate any
    alerts generated by this rule to determine if they are indicative of
    malicious activity or part of legitimate system activity.
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: selection1 and (selection2 and not filter)
  selection1:
    host.os.type:
      - linux
    auditd.data.syscall:
      - mprotect
    auditd.data.a2|contains:
      - '7'
  selection2:
    host.os.type:
      - linux
    event.type:
      - start
  filter:
    destination.ip|contains:
      - 127.0.0.0/8
      - 169.254.0.0/16
      - 224.0.0.0/4
      - '::1'
