id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Network Connect via Recently Compiled Exe
description: >-
  This rule monitors a sequence involving a program compilation event followed
  by its execution and a subsequent network connection event. This behavior can
  indicate the setup of a reverse TCP connection to a command-and-control
  server. Attackers may spawn reverse shells to establish persistence onto a
  target system.
tags:
  - attack.execution
  - attack.TA0002
  - attack.T1059
  - attack.T1071
  - attack.TA0011
  - attack.t1059.004
falsepositives:
  - >-
    There is a potential for false positives if the compilation, execution, and
    network connection are part of legitimate activities, such as software
    development and testing. It is important to investigate any alerts generated
    by this rule to determine if they are indicative of malicious activity or
    part of legitimate system activity.
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: sequence1 and sequence2 and sequence3 and (sequence4 and not filter)
  sequence1:
    host.os.type:
      - linux
    event.type:
      - start
    event.action|contains:
      - exec
      - executed
    process.name|contains:
      - gcc
      - g++
      - cc
  sequence2:
    host.os.type:
      - linux
    event.action:
      - creation
    process.name:
      - ld
  sequence3:
    host.os.type:
      - linux
    event.type:
      - start
    event.action|contains:
      - exec
      - executed
  sequence4:
    host.os.type:
      - linux
  filter:
    destination.ip|contains:
      - 'null'
      - 127.0.0.0/8
      - 169.254.0.0/16
      - 224.0.0.0/4
      - '::1'
