id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Potential Reverse Shell via Child
description: >-
  This detection rule identifies suspicious network traffic patterns associated
  with TCP reverse shell activity. This activity consists of a network event
  that is followed by the creation of a shell process with suspicious command
  line arguments. An attacker may establish a Linux TCP reverse shell to gain
  remote access to a target system.
tags:
  - attack.execution
  - attack.TA0002
  - attack.command_and_control
  - attack.TA0011
  - attack.t1059
  - attack.t1071
  - attack.t1059.004
falsepositives: []
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: (Selection_1 and not filter1) and (Selection_2 and (filter2 or filter3))
  Selection_1:
    host.os.type|all:
      - linux
    event.type|all:
      - start
    event.action|contains:
      - connection_attempted
      - connection_accepted
      - connected-to
    process.name|contains:
      - bash
      - dash
      - sh
      - tcsh
      - csh
      - zsh
      - ksh
      - fish
      - socat
  filter1:
    destination.ip|contains:
      - 127.0.0.0/8
      - 169.254.0.0/16
      - 224.0.0.0/4
      - '::1'
  Selection_2:
    event.type|all:
      - start
    host.os.type|all:
      - linux
    event.action|all:
      - exec
    process.name|contains:
      - bash
      - dash
      - sh
      - tcsh
      - csh
      - zsh
      - ksh
      - fish
  filter2:
    process.args|contains:
      - '-i'
      - '-l'
  filter3:
    process.name|all:
      - socat
    process.args|all:
      - '*exec*'
