id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
  service: auditbeat
title: Potential Reverse Shell via Background Process
description: >-
  Monitors for the execution of background processes with process arguments capable of opening a socket in the /dev/tcp channel. This may indicate the creation of a backdoor reverse connection and should be investigated further.
tags:
  - attack.execution
  - attack.command_and_control
  - attack.TA0002
  - attack.T1059
  - attack.TA0011
  - attack.T1071
  - attack.t1059.004
falsepositives:
  - >-
    There is a potential for false positives if the background processes are used for legitimate purposes such as system administration, maintenance, or troubleshooting tasks by system administrators. It is important to investigate any alerts generated by this rule to determine if they are indicative of malicious activity or part of legitimate system activities.
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  selection:
    host.os.type: linux
    event.type: start
    event.action|contains:
      - exec
      - exec_event
      - executed
    process.name|contains:
      - setsid
      - nohup
    process.args: "*/dev/tcp/*0>&1*"
    process.name|contains:
      - bash
      - dash
      - sh
      - tcsh
      - csh
      - zsh
      - ksh
      - fish
  condition: selection
