id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Potential Linux Hack Tool Launched
description: >-
  Monitors for the execution of different processes that might be used by
  attackers for malicious intent. An alert from this rule should be investigated
  further, as hack tools are commonly used by blue teamers and system
  administrators as well.
tags:
  - attack.execution
  - attack.TA0002
falsepositives:
  - >-
    There is a potential for false positives if the hack tools are used for
    legitimate purposes such as maintenance, troubleshooting, or security
    assessments. It is important to investigate any alerts generated by this rule
    to determine if they are indicative of malicious activity or part of
    legitimate system activity.
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: selection
  selection:
    host.os.type: linux
    event.type: start
    event.action|contains:
      - exec
      - exec_event
      - executed
      - process_started
    process.name|contains:
      - crackmapexec
      - msfconsole
      - msfvenom
      - sliver-client
      - sliver-server
      - havoc
      - zenmap
      - nuclei
      - netdiscover
      - legion
      - gobuster
      - dirbuster
      - dirb
      - wfuzz
      - ffuf
      - whatweb
      - eyewitness
      - wpscan
      - joomscan
      - droopescan
      - nikto
      - sqlmap
      - commix
      - yersinia
      - john
      - hashcat
      - hydra
      - ncrack
      - cewl
      - fcrackzip
      - rainbowcrack
      - linenum.sh
      - linpeas.sh
      - pspy32
      - pspy32s
      - pspy64
      - pspy64s
      - binwalk
      - evil-winrm
fields:
  - host.os.type
  - event.type
  - event.action
  - process.name
