id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
  service: auditbeat
title: Potential Meterpreter Reverse Shell
description: >-
  This detection rule identifies a sample of suspicious Linux system file reads used for system fingerprinting, leveraged by the Metasploit Meterpreter shell to gather information about the target that it is executing its shell on. Detecting this pattern is indicative of a successful meterpreter shell connection.
tags:
  - attack.t1059.004
  - attack.execution
  - attack.command_and_control
  - attack.TA0002
  - attack.T1059
  - attack.TA0011
  - attack.T1071
falsepositives: []
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  selection:
    host.os.type: linux
    auditd.data.syscall: open
    auditd.data.a2: 1b6
    file.path|contains:
      - /etc/machine-id
      - /etc/passwd
      - /proc/net/route
      - /proc/net/ipv6_route
      - /proc/net/if_inet6
  condition: selection
