id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Potential Code Execution via PostgreSQL
description: >-
  This rule monitors for suspicious activities that may indicate an attacker attempting to execute arbitrary code within a PostgreSQL environment. Attackers can execute code via PostgreSQL as a result of gaining unauthorized access to a public-facing PostgreSQL database or exploiting vulnerabilities, such as remote command execution and SQL injection attacks, which can result in unauthorized access and malicious actions, and facilitate post-exploitation activities for unauthorized access and malicious actions.
tags:
  - attack.execution
  - attack.TA0002
  - attack.T1059
  - attack.t1059.004
falsepositives:
  - >-
    There is a potential for false positives if the code execution commands are used for legitimate purposes such as maintenance, troubleshooting, or automated tasks by PostgreSQL administrators. It is important to investigate any alerts generated by this rule to determine if they are indicative of malicious activity or part of legitimate database management activities.
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: selection and filter1 and not filter2
  selection:
    host.os.type: linux
    event.type: start
    event.action|contains:
      - exec
      - exec_event
      - fork
      - fork_event
      - executed
    user.name: postgres
  filter1:
    process.args|contains:
      - "*sh"
      - "echo*"
  filter2:
    process.parent.name: puppet
