id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Potential Upgrade of Non-interactive Shell
description: >-
  Identifies when a non-interactive terminal (tty) is being upgraded to a fully
  interactive shell. Attackers may upgrade a simple reverse shell to a fully
  interactive tty after obtaining initial access to a host, in order to obtain a
  more stable connection.
tags:
  - attack.execution
  - attack.TA0002
  - attack.T1059
  - attack.t1059.004
falsepositives:
  - >-
    Legitimate use of stty and script commands for non-malicious purposes may
    trigger this rule. Investigate the context of the actions to determine if
    they are benign or malicious.
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: selection and (filter1 or filter2)
  selection:
    host.os.type:
      - linux
    event.type:
      - start
    event.action|contains:
      - exec
      - exec_event
      - executed
  filter1:
    process.name|all:
      - stty
    process.args|contains:
      - raw
      - '-echo'
  filter2:
    process.name|contains:
      - script
    process.args|contains:
      - '-qc'
      - '-c'
      - '/dev/null'
