id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Python Script Execution via Command Line
description: >-
  Identifies when a Python script is executed using command line input and
  imports the sys module. Attackers often use this method to execute malicious
  scripts and avoiding writing it to disk.
tags:
  - attack.execution
  - attack.TA0002
  - attack.t1059
  - attack.auditbeat
  - attack.t1059.006
  - attack.t1059.003
falsepositives: []
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: Selection_1
  Selection_1:
    event.type|contains:
      - start
      - process_started
    process.name|contains:
      - python*
    process.args|all:
      - '-c'
      - '*import*sys*'
