id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
title: Sus Content Extracted or Decompressed via Funzip
description: >-
  Identifies when suspicious content is extracted from a file and subsequently
  decompressed using the funzip utility. Malware may execute the tail utility
  using the -c option to read a sequence of bytes from the end of a file. The
  output from tail can be piped to funzip in order to decompress malicious code
  before it is executed. This behavior is consistent with malware families such
  as Bundlore.
tags:
  - attack.execution
  - attack.defense_evasion
  - attack.TA0002
  - attack.T1059
  - attack.TA0005
  - attack.T1027
  - attack.T1140
  - attack.t1059.004
falsepositives: []
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: selection and not filter
  selection:
    host.os.type: linux
    event.action|contains:
      - exec
      - exec_event
      - executed
    process.args|all:
      - tail
      - '-c'
      - funzip
  filter:
    process.args: /var/log/messages
    process.executable|contains:
      - /usr/bin/dracut
      - /sbin/dracut
      - /usr/bin/xargs
    process.name|contains:
        - sh
        - sudo
    process.args|contains: '*nessus_su*'
