id: 25b9c01c-350d-4b95-bed1-836d04a4f324
logsource:
  product: linux
  service: auditbeat
title: Suspicious Mining Process Creation Event
description: >-
  Identifies service creation events of common mining services, possibly indicating the infection of a system with a cryptominer.
tags:
  - attack.execution
  - attack.TA0002
  - attack.T1059
  - attack.t1059.004
falsepositives: []
level: medium
status: experimental
references: []
author: hoang.nguyen
detection:
  condition: selection
  selection:
    host.os.type: linux
    event.type: creation
    event.action|contains:
      - creation
      - file_create_event
    file.name|contains:
      - aliyun.service
      - moneroocean_miner.service
      - c3pool_miner.service
      - pnsd.service
      - apache4.service
      - pastebin.service
      - xvf.service
